MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_rtc.h
  * @brief   Header file of RTC LL module
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5xx_LL_RTC_H
#define STM32C5xx_LL_RTC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(RTC)

/** @defgroup RTC_LL RTC
  * @{
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup RTC_LL_Private_Constants RTC Private Constants
  * @{
  */
/**
  * @brief Write protection defines
  */
#define RTC_WRITE_PROTECTION_DISABLE  (uint32_t)0xFF
#define RTC_WRITE_PROTECTION_ENABLE_1 (uint32_t)0xCA
#define RTC_WRITE_PROTECTION_ENABLE_2 (uint32_t)0x53

/**
  * @brief Defines used to combine date & time
  */
#define RTC_OFFSET_WEEKDAY 24U
#define RTC_OFFSET_DAY     16U
#define RTC_OFFSET_MONTH    8U
#define RTC_OFFSET_HOUR    16U
#define RTC_OFFSET_MINUTE   8U
#define RTC_OFFSET_FORMAT  24U

/**
  * @brief Defines offset between alarm A and B registers
  */
#define RTC_ALRBR_ALRAR_OFFSET       0x02U
#define RTC_ALRBSSR_ALRASSR_OFFSET   0x02U
#define RTC_ALRBBINR_ALRABINR_OFFSET 0x01U

/**
  * @brief Defines used to combine alarm mask subseconds and subseconds
  */
#define RTC_OFFSET_ALR_MASK_SUBS_SECONDS 16U
/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup RTC_LL_Exported_Constants LL RTC Constants
  * @{
  */

/** @defgroup RTC_LL_EC_ALM Alarm A and alarm B
  * @{
  */
#define LL_RTC_ALARM_A    0U /*!< Alarm A */
#define LL_RTC_ALARM_B    1U /*!< Alarm B */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMA_WEEKDAY_SELECTION RTC alarm A date weekday
  * @{
  */
#define LL_RTC_ALMA_DATEWEEKDAYSEL_DATE    0U               /*!< Alarm A Date is selected    */
#define LL_RTC_ALMA_DATEWEEKDAYSEL_WEEKDAY RTC_ALRMAR_WDSEL /*!< Alarm A WeekDay is selected */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMB_WEEKDAY_SELECTION RTC alarm B date weekday
  * @{
  */
#define LL_RTC_ALMB_DATEWEEKDAYSEL_DATE    0U               /*!< Alarm B Date is selected    */
#define LL_RTC_ALMB_DATEWEEKDAYSEL_WEEKDAY RTC_ALRMBR_WDSEL /*!< Alarm B WeekDay is selected */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TIMESTAMP_FLAGS Timestamp flags defines
  * @brief    Timestamp flags defines
  * @{
  */
#define LL_RTC_SR_TSOVF RTC_SR_TSOVF /*!< Timestamp overflow event */
#define LL_RTC_SR_TSF   RTC_SR_TSF   /*!< Timestamp event          */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CLEAR_FLAG Clear flags defines
  * @brief    Flags defines which can be used with LL_RTC_WRITE_REG function
  * @{
  */
#define LL_RTC_SCR_SSRUF    RTC_SCR_CSSRUF /*!< Clear SSR underflow event      */
#define LL_RTC_SCR_TSOVF    RTC_SCR_CTSOVF /*!< Clear timestamp overflow event */
#define LL_RTC_SCR_TSF      RTC_SCR_CTSF   /*!< Clear timestamp event          */
#define LL_RTC_SCR_WUTF     RTC_SCR_CWUTF  /*!< Clear wake-up timer event      */
#define LL_RTC_SCR_ALRBF    RTC_SCR_CALRBF /*!< Clear alarm B event            */
#define LL_RTC_SCR_ALRAF    RTC_SCR_CALRAF /*!< Clear alarm A event            */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_GET_FLAG Get flags defines
  * @brief    Flags defines which can be used with LL_RTC_READ_REG function
  * @{
  */
#define LL_RTC_ICSR_RECALPF RTC_ICSR_RECALPF /*!< Recalibration pending event     */
#define LL_RTC_ICSR_INITF   RTC_ICSR_INITF   /*!< Initialization flag             */
#define LL_RTC_ICSR_RSF     RTC_ICSR_RSF     /*!< Registers synchronization event */
#define LL_RTC_ICSR_INITS   RTC_ICSR_INITS   /*!< Initialization status event     */
#define LL_RTC_ICSR_SHPF    RTC_ICSR_SHPF    /*!< Shift operation pending event   */
#define LL_RTC_ICSR_WUTWF   RTC_ICSR_WUTWF   /*!< Wake-up timer write event       */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BCD BCD defines
  * @brief    BCD defines which can be used with LL_RTC_READ_REG and  LL_RTC_WRITE_REG functions
  * @{
  */
#define LL_RTC_ICSR_BCDU_2  RTC_ICSR_BCDU_2 /*!< 1s calendar increment is generated each time SS[9:0]  */
#define LL_RTC_ICSR_BCDU_1  RTC_ICSR_BCDU_1 /*!< 1s calendar increment is generated each time SS[8:0]  */
#define LL_RTC_ICSR_BCDU_0  RTC_ICSR_BCDU_0 /*!< 1s calendar increment is generated each time SS[7:0]  */
#define LL_RTC_ICSR_BIN_1   RTC_ICSR_BIN_1  /*!< Free-running Binary mode (BCD mode disabled)          */
#define LL_RTC_ICSR_BIN_0   RTC_ICSR_BIN_0  /*!< Free-running BCD calendar mode (Binary mode disabled) */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_IT IT defines
  * @brief    IT defines which can be  used with LL_RTC_READ_REG and  LL_RTC_WRITE_REG functions
  * @{
  */
#define LL_RTC_CR_TSIE   RTC_CR_TSIE   /*!< Timestamp on internal event enable */
#define LL_RTC_CR_WUTIE  RTC_CR_WUTIE  /*!< Wake-up timer interrupt enable     */
#define LL_RTC_CR_ALRBIE RTC_CR_ALRBIE /*!< Alarm B interrupt enable           */
#define LL_RTC_CR_ALRAIE RTC_CR_ALRAIE /*!< Alarm A interrupt enable           */
/**
  * @}
  */

