MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/** @defgroup RTC_LL_EC_WEEKDAY  Weekday
  * @{
  */
#define LL_RTC_WEEKDAY_MONDAY    (uint32_t)0x01 /*!< Monday    */
#define LL_RTC_WEEKDAY_TUESDAY   (uint32_t)0x02 /*!< Tuesday   */
#define LL_RTC_WEEKDAY_WEDNESDAY (uint32_t)0x03 /*!< Wednesday */
#define LL_RTC_WEEKDAY_THURSDAY  (uint32_t)0x04 /*!< Thursday  */
#define LL_RTC_WEEKDAY_FRIDAY    (uint32_t)0x05 /*!< Friday    */
#define LL_RTC_WEEKDAY_SATURDAY  (uint32_t)0x06 /*!< Saturday  */
#define LL_RTC_WEEKDAY_SUNDAY    (uint32_t)0x07 /*!< Sunday    */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_MONTH  Month
  * @{
  */
#define LL_RTC_MONTH_JANUARY   (uint32_t)0x01  /*!< January   */
#define LL_RTC_MONTH_FEBRUARY  (uint32_t)0x02  /*!< February  */
#define LL_RTC_MONTH_MARCH     (uint32_t)0x03  /*!< March     */
#define LL_RTC_MONTH_APRIL     (uint32_t)0x04  /*!< April     */
#define LL_RTC_MONTH_MAY       (uint32_t)0x05  /*!< May       */
#define LL_RTC_MONTH_JUNE      (uint32_t)0x06  /*!< June      */
#define LL_RTC_MONTH_JULY      (uint32_t)0x07  /*!< July      */
#define LL_RTC_MONTH_AUGUST    (uint32_t)0x08  /*!< August    */
#define LL_RTC_MONTH_SEPTEMBER (uint32_t)0x09  /*!< September */
#define LL_RTC_MONTH_OCTOBER   (uint32_t)0x10  /*!< October   */
#define LL_RTC_MONTH_NOVEMBER  (uint32_t)0x11  /*!< November  */
#define LL_RTC_MONTH_DECEMBER  (uint32_t)0x12  /*!< December  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_HOUR_FORMAT  Hour format
  * @{
  */
#define LL_RTC_HOUR_FORMAT_24HOUR 0U         /*!< 24 hour/day format */
#define LL_RTC_HOUR_FORMAT_AMPM   RTC_CR_FMT /*!< AM/PM hour format  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_REF_CLOCK Reference clock
  * @{
  */
#define LL_RTC_REF_CLOCK_DISABLE 0U             /*!< Reference clock detection disabled */
#define LL_RTC_REF_CLOCK_ENABLE  RTC_CR_REFCKON /*!< Reference clock detection enabled  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_SHADOW_REGISTER Shadow register
  * @{
  */
#define LL_RTC_SHADOW_REG_KEEP   0U             /*!< Bypass shadow register disabled */
#define LL_RTC_SHADOW_REG_BYPASS RTC_CR_BYPSHAD /*!< Bypass shadow register enabled  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BKP_REGISTER Backup register for daylight saving time
  * @{
  */
#define LL_RTC_BKP_REGISTER_UNSET 0U          /*!< Daylight time change has not been performed */
#define LL_RTC_BKP_REGISTER_SET   RTC_CR_BKP  /*!< Daylight time change has been performed     */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALARMOUT  Alarm output
  * @{
  */
#define LL_RTC_ALARMOUT_DISABLE 0U              /*!< Output disabled        */
#define LL_RTC_ALARMOUT_ALARM_A    RTC_CR_OSEL_0 /*!< Alarm A output enabled */
#define LL_RTC_ALARMOUT_ALARM_B    RTC_CR_OSEL_1 /*!< Alarm B output enabled */
#define LL_RTC_ALARMOUT_WAKEUP  RTC_CR_OSEL     /*!< Wake-up output enabled */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALARM_OUTPUTTYPE  Alarm output type
  * @{
  */
#define LL_RTC_ALARM_OUTPUTTYPE_PUSHPULL    0U                   /*!< RTC_ALARM is push-pull output  */
#define LL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN   RTC_CR_TAMPALRM_TYPE /*!< RTC_ALARM is open-drain output */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALARM_OUTPUT_PULLUP  Alarm output pull-up
  * @{
  */
#define LL_RTC_ALARM_OUTPUT_PULLUP_NONE   0U                 /*!< No pull-up is applied on TAMPALRM output */
#define LL_RTC_ALARM_OUTPUT_PULLUP_ON     RTC_CR_TAMPALRM_PU /*!< A pull-up is applied on TAMPALRM output  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALARM_OUTPUT_REMAP  Alarm output remap
  * @{
  */
#define LL_RTC_ALARM_OUTPUT_REMAP_NONE  0U             /*!< RTC_OUT2 output disabled */
#define LL_RTC_ALARM_OUTPUT_REMAP_POS1  RTC_CR_OUT2EN  /*!< RTC_OUT2 output enabled  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_OUTPUTPOLARITY_PIN  Output polarity pin
  * @{
  */
#define LL_RTC_OUTPUTPOLARITY_PIN_HIGH  0U          /*!< Pin is high when selected TAMPALRM is asserted */
#define LL_RTC_OUTPUTPOLARITY_PIN_LOW   RTC_CR_POL  /*!< Pin is low when selected TAMPALRM is asserted  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TIME_FORMAT Time format
  * @{
  */
#define LL_RTC_TIME_FORMAT_AM_24H     0U          /*!< AM or 24-hour format */
#define LL_RTC_TIME_FORMAT_PM         RTC_TR_PM   /*!< PM                   */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_SHIFT_SECOND  Shift second
  * @{
  */
#define LL_RTC_SHIFT_SECOND_DELAY   0U               /*!< Delay (seconds) = SUBFS / (PREDIV_S + 1)     */
#define LL_RTC_SHIFT_SECOND_ADVANCE RTC_SHIFTR_ADD1S /*!< Advance (seconds) = (1-(SUBFS/(PREDIV_S+1))) */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMA_MASK  ALARMA mask
  * @{
  */
#define LL_RTC_ALMA_MASK_NONE        0U               /*!< No masks applied on alarm A                */
#define LL_RTC_ALMA_MASK_DATEWEEKDAY RTC_ALRMAR_MSK4  /*!< Date/day ignored in alarm A comparison */
#define LL_RTC_ALMA_MASK_HOURS       RTC_ALRMAR_MSK3  /*!< Hours ignored in alarm A comparison    */
#define LL_RTC_ALMA_MASK_MINUTES     RTC_ALRMAR_MSK2  /*!< Minutes ignored in alarm A comparison  */
#define LL_RTC_ALMA_MASK_SECONDS     RTC_ALRMAR_MSK1  /*!< Seconds ignored in alarm A comparison  */
#define LL_RTC_ALMA_MASK_ALL         (RTC_ALRMAR_MSK4 | RTC_ALRMAR_MSK3 | RTC_ALRMAR_MSK2 | RTC_ALRMAR_MSK1)
/*!< Masks all */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMA_TIME_FORMAT  ALARMA time format
  * @{
  */
#define LL_RTC_ALMA_TIME_FORMAT_AM_24H  0U            /*!< AM or 24-hour format */
#define LL_RTC_ALMA_TIME_FORMAT_PM      RTC_ALRMAR_PM /*!< PM                   */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMA_AUTOCLR RTC alarm auto clear
  * @{
  */
#define LL_RTC_ALM_AUTOCLR_NO  0U              /*!< Alarm autoclear disabled */
#define LL_RTC_ALM_AUTOCLR_YES RTC_CR_ALRAFCLR /*!< Alarm autoclear enabled  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMA_SUBSECONDBIN_AUTOCLR  RTC alarm sub seconds with binary mode auto clear definitions
  * @{
  */
#define LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_NO  0UL                /*!< The synchronous binary counter \
                                                                    (SS[31:0] in RTC_SSR) is free-running */
#define LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_YES RTC_ALRMASSR_SSCLR /*!< The synchronous binary counter (SS[31:0] \
                                                                     in RTC_SSR) is running from 0xFFFF FFFF to \
                                                                     -> SS[31:0] value and is automatically \
                                                                     reloaded with 0xFFFF FFFF when reaching \
                                                                     RTC_ALRABINR -> SS[31:0] */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMB_MASK  ALARMB mask
  * @{
  */
#define LL_RTC_ALMB_MASK_NONE        0U              /*!< No masks applied on Alarm B                */
#define LL_RTC_ALMB_MASK_DATEWEEKDAY RTC_ALRMBR_MSK4 /*!< Date/day ignored in alarm B comparison */
#define LL_RTC_ALMB_MASK_HOURS       RTC_ALRMBR_MSK3 /*!< Hours ignored in alarm B comparison    */
#define LL_RTC_ALMB_MASK_MINUTES     RTC_ALRMBR_MSK2 /*!< Minutes ignored in alarm B comparison  */
#define LL_RTC_ALMB_MASK_SECONDS     RTC_ALRMBR_MSK1 /*!< Seconds ignored in alarm B comparison  */
#define LL_RTC_ALMB_MASK_ALL         (RTC_ALRMBR_MSK4 | RTC_ALRMBR_MSK3 | RTC_ALRMBR_MSK2 | RTC_ALRMBR_MSK1)
/*!< Masks all */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMB_TIME_FORMAT  ALARMB time format
  * @{
  */
#define LL_RTC_ALMB_TIME_FORMAT_AM_24H 0U        /*!< AM or 24-hour format */
#define LL_RTC_ALMB_TIME_FORMAT_PM RTC_ALRMBR_PM /*!< PM                   */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALMB_SUBSECONDBIN_AUTOCLR  Alarm sub seconds with binary mode auto clear definitions
  * @{
  */
#define LL_RTC_ALMB_SUBSECONDBIN_AUTOCLR_NO  0UL                /*!< The synchronous binary counter \
                                                                     (SS[31:0] in RTC_SSR) is free-running */
#define LL_RTC_ALMB_SUBSECONDBIN_AUTOCLR_YES RTC_ALRMBSSR_SSCLR /*!< The synchronous binary counter \
                                                                     (SS[31:0] in RTC_SSR) is running \
                                                                     from 0xFFFF FFFF to RTC_ALRABINR -> SS[31:0]\
                                                                     value and is automatically reloaded with \
                                                                     0xFFFF FFFF when reaching \
                                                                     RTC_ALRABINR -> SS[31:0] */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TIMESTAMP_EDGE  Timestamp edge
  * @{
  */
#define LL_RTC_TIMESTAMP_EDGE_RISING  0U            /*!< RTC_TS input rising edge generates a time-stamp event */
#define LL_RTC_TIMESTAMP_EDGE_FALLING RTC_CR_TSEDGE /*!< RTC_TS input falling edge generates a time-stamp event */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TIMESTAMP_PIN_ENABLE Timestamp pin source enable
  * @{
  */

