MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
#define LL_RTC_TIMESTAMP_PIN_DISABLE 0U         /*!< Timestamp disabled */
#define LL_RTC_TIMESTAMP_PIN_ENABLE  RTC_CR_TSE /*!< Timestamp enabled  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TIMESTAMP_TAMPER_ENABLE Timestamp tamper source enable
  * @{
  */

#define LL_RTC_TIMESTAMP_TAMPER_DISABLE 0U            /*!< Disable timestamp on tamper detection event */
#define LL_RTC_TIMESTAMP_TAMPER_ENABLE  RTC_CR_TAMPTS /*!< Enable timestamp on tamper detection event  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TS_TIME_FORMAT  Timestamp time format
  * @{
  */
#define LL_RTC_TS_TIME_FORMAT_AM_24H 0U          /*!< AM or 24-hour format */
#define LL_RTC_TS_TIME_FORMAT_PM     RTC_TSTR_PM /*!< PM                   */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_WAKEUPCLOCK_DIV  Wakeup clock div
  * @{
  */
#define LL_RTC_WAKEUPCLOCK_DIV_16     0U                                    /*!< RTC/16 clock is selected */
#define LL_RTC_WAKEUPCLOCK_DIV_8      RTC_CR_WUCKSEL_0                      /*!< RTC/8 clock is selected  */
#define LL_RTC_WAKEUPCLOCK_DIV_4      RTC_CR_WUCKSEL_1                      /*!< RTC/4 clock is selected  */
#define LL_RTC_WAKEUPCLOCK_DIV_2      (RTC_CR_WUCKSEL_1 | RTC_CR_WUCKSEL_0) /*!< RTC/2 clock is selected  */
#define LL_RTC_WAKEUPCLOCK_CKSPRE     RTC_CR_WUCKSEL_2                      /*!< ck_spre (usually 1 Hz) clock is
                                                                                 selected */
#define LL_RTC_WAKEUPCLOCK_CKSPRE_WUT (RTC_CR_WUCKSEL_2 | RTC_CR_WUCKSEL_1) /*!< ck_spre (usually 1 Hz) clock is
                                                                                 selected and 2exp16 is added to the WUT
                                                                                 counter value */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TAMPER_OUTPUT Tamper event output
  * @{
  */
#define LL_RTC_OUTPUT_TAMPER_DISABLE 0U            /*!< Disable Tamper detection output */
#define LL_RTC_OUTPUT_TAMPER_ENABLE  RTC_CR_TAMPOE /*!< Enable Tamper detection output  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CALIB_FREQUENCY_OUTPUT Calibration frequency output
  * @{
  */
#define LL_RTC_CALIB_FREQUENCY_512HZ  0U           /*!< Calibration output is 512 Hz */
#define LL_RTC_CALIB_FREQUENCY_1HZ    RTC_CR_COSEL /*!< Calibration output is 1 Hz   */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CALIB_OUTPUT  Calibration output
  * @{
  */
#define LL_RTC_CALIB_OUTPUT_NONE    0U                          /*!< Calibration output disabled  */
#define LL_RTC_CALIB_OUTPUT_ENABLE  RTC_CR_COE                  /*!< Calibration output enabled with current
                                                                     configuration */
#define LL_RTC_CALIB_OUTPUT_1HZ     (RTC_CR_COE | RTC_CR_COSEL) /*!< Calibration output is 1 Hz   */
#define LL_RTC_CALIB_OUTPUT_512HZ   RTC_CR_COE                  /*!< Calibration output is 512 Hz */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CALIB_INSERTPULSE  Calibration pulse insertion
  * @{
  */
#define LL_RTC_CALIB_INSERTPULSE_NONE 0U            /*!< No RTCCLK pulses are added */
#define LL_RTC_CALIB_INSERTPULSE_SET  RTC_CALR_CALP /*!< One RTCCLK pulse is effectively inserted every 2exp11 pulses
                                                         (frequency increased by 488.5 ppm) */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CALIB_PERIOD  Calibration period
  * @{
  */
#define LL_RTC_CALIB_PERIOD_32SEC 0U              /*!< Use a 32-second calibration cycle period */
#define LL_RTC_CALIB_PERIOD_16SEC RTC_CALR_CALW16 /*!< Use a 16-second calibration cycle period */
#define LL_RTC_CALIB_PERIOD_8SEC  RTC_CALR_CALW8  /*!< Use an 8-second calibration cycle period  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CALIB_LOWPOWER  Calibration low power
  * @{
  */
#define LL_RTC_CALIB_LOWPOWER_NONE 0U             /*!< High-consumption mode      */
#define LL_RTC_CALIB_LOWPOWER_SET  RTC_CALR_LPCAL /*!< Ultra-low consumption mode */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BINARY_MODE  Binary mode (sub second register)
  * @{
  */
#define LL_RTC_BINARY_NONE 0U             /*!< Free-running BCD calendar mode (Binary mode disabled) */
#define LL_RTC_BINARY_ONLY RTC_ICSR_BIN_0 /*!< Free-running Binary mode (BCD mode disabled)          */
#define LL_RTC_BINARY_MIX  RTC_ICSR_BIN_1 /*!< Free-running BCD calendar and Binary mode enabled     */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BINARY_MIX_BCDU  Calendar second incrementation in binary mix mode
  * @{
  */
#define LL_RTC_BINARY_MIX_BCDU_SHIFT RTC_ICSR_BCDU_Pos
#define LL_RTC_BINARY_MIX_BCDU_0     0U                           /*!< 1s calendar increment is generated each time
                                                                       SS[7:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_1     (0x1UL << RTC_ICSR_BCDU_Pos) /*!< 1s calendar increment is generated each time
                                                                       SS[8:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_2     (0x2UL << RTC_ICSR_BCDU_Pos) /*!< 1s calendar increment is generated each time
                                                                       SS[9:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_3     (0x3UL << RTC_ICSR_BCDU_Pos) /*!< 1s calendar increment is generated each time
                                                                       SS[10:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_4     (0x4UL << RTC_ICSR_BCDU_Pos) /*!< 1s calendar increment is generated each time
                                                                       SS[11:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_5     (0x5UL << RTC_ICSR_BCDU_Pos) /*!< 1s calendar increment is generated each time
                                                                       SS[12:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_6     (0x6UL << RTC_ICSR_BCDU_Pos) /*!< 1s calendar increment is generated each time
                                                                       SS[13:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_7     (0x7UL << RTC_ICSR_BCDU_Pos) /*!< 1s calendar increment is generated each time
                                                                       SS[14:0] = 0 */
/**
  * @}
  */

/** @defgroup RTC_privilege_attributes_configuration_items RTC privilege attributes configuration items
  * @{
  */
#define LL_RTC_ATTR_NPRIV 0UL /*!< Non-privileged attribute */
#define LL_RTC_ATTR_PRIV  1UL /*!< Privileged attribute     */

#define LL_RTC_PRIV_ITEM_ALRAPRIV RTC_PRIVCFGR_ALRAPRIV /*!< Privilege attribute of Alarm A and underflow protection */
#define LL_RTC_PRIV_ITEM_ALRBPRIV RTC_PRIVCFGR_ALRBPRIV /*!< Privilege attribute of Alarm B protection               */
#define LL_RTC_PRIV_ITEM_WUTPRIV  RTC_PRIVCFGR_WUTPRIV  /*!< Privilege attribute of Wake-up timer protection         */
#define LL_RTC_PRIV_ITEM_TSPRIV   RTC_PRIVCFGR_TSPRIV   /*!< Privilege attribute of Timestamp protection             */
#define LL_RTC_PRIV_ITEM_CALPRIV  RTC_PRIVCFGR_CALPRIV  /*!< Privilege attribute of  Shift register, daylightcalibration
                                                          and reference clock protection                          */
#define LL_RTC_PRIV_ITEM_INITPRIV RTC_PRIVCFGR_INITPRIV /*!< Privilege attribute of Initialization protection        */
#define LL_RTC_PRIV_ITEM_PRIV     RTC_PRIVCFGR_PRIV     /*!< Privilege attribute of RTC global protection            */
#define LL_RTC_PRIV_ITEM_ALL     (RTC_PRIVCFGR_ALRAPRIV | RTC_PRIVCFGR_ALRBPRIV | RTC_PRIVCFGR_WUTPRIV  | \
                                  RTC_PRIVCFGR_TSPRIV   | RTC_PRIVCFGR_CALPRIV  | RTC_PRIVCFGR_INITPRIV | \
                                  RTC_PRIVCFGR_PRIV )  /*!< All RTC resources configuration item                    */
/*
  * @}
  */

/** @defgroup RTC_LL_EC_WAKEUP_TIMER_INTERRUPT Wakeup timer interrupt definition
  * @{
  */
#define LL_RTC_WAKEUP_TIMER_IT_DISABLE 0U           /*!< Wake-up timer interrupt disable */
#define LL_RTC_WAKEUP_TIMER_IT_ENABLE  RTC_CR_WUTIE /*!< Wake-up timer interrupt enable  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALARMA_INTERRUPT Alarm A interrupt definition
  * @{
  */
#define LL_RTC_ALMA_IT_DISABLE 0U            /*!< Alarm A interrupt disable */
#define LL_RTC_ALMA_IT_ENABLE  RTC_CR_ALRAIE /*!< Alarm A interrupt enable  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_ALARMB_INTERRUPT Alarm B interrupt definition
  * @{
  */
#define LL_RTC_ALMB_IT_DISABLE 0U            /*!< Alarm B interrupt disable */
#define LL_RTC_ALMB_IT_ENABLE  RTC_CR_ALRBIE /*!< Alarm B interrupt enable  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TIMESTAMP_INTERRUPT Timestamp interrupt definition
  * @{
  */
#define LL_RTC_TIMESTAMP_IT_DISABLE 0U          /*!< Timestamp interrupt disable */
#define LL_RTC_TIMESTAMP_IT_ENABLE  RTC_CR_TSIE /*!< Timestamp interrupt enable  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_SSRU_INTERRUPT Sub seconds register underflow interrupt definition
  * @{
  */
#define LL_RTC_SSRU_IT_DISABLE 0U            /*!< SSR underflow interrupt disable */
#define LL_RTC_SSRU_IT_ENABLE  RTC_CR_SSRUIE /*!< SSR underflow interrupt enable  */
/**
  * @}
  */

/**
  * @}
  */

