MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup RTC_LL_Exported_Macros LL RTC Macros
  * @{
  */

/** @defgroup RTC_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RTC register.
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_RTC_WRITE_REG(reg, value) STM32_WRITE_REG(RTC->reg, (value))

/**
  * @brief  Read a value in RTC register.
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_RTC_READ_REG(reg) STM32_READ_REG(RTC->reg)

/**
  * @}
  */

/** @defgroup RTC_LL_EM_Convert Convert helper Macros
  * @{
  */

/**
  * @brief  Helper macro to convert a value from 2 digit decimal format to BCD format.
  * @param  value Byte to be converted
  * @retval Converted byte
  */
#define LL_RTC_CONVERT_BIN2BCD(value) ((uint32_t)((((value) / 10U) << 4U) | ((value) % 10U)))

/**
  * @brief  Helper macro to convert a value from BCD format to 2 digit decimal format.
  * @param  value BCD value to be converted
  * @retval Converted byte
  */
#define LL_RTC_CONVERT_BCD2BIN(value) ((uint32_t)((((uint32_t)((value) & (uint32_t)0xF0U) >> \
                                                    (uint32_t)0x4U) * 10U) + ((value) & (uint32_t)0x0FU)))

/**
  * @}
  */

/** @defgroup RTC_LL_EM_Global Global configuration helper Macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve the value of the asynchronous prescaler.
  * @param  value Value returned by @ref LL_RTC_GetPrescalers
  * @retval Value of the asynchronous prescaler
  */
#define LL_RTC_GET_ASYNCH_PRESCALER(value) (((value) & RTC_PRER_PREDIV_A) >> RTC_PRER_PREDIV_A_Pos)

/**
  * @brief  Helper macro to retrieve the value of the synchronous prescaler.
  * @param  value Value returned by @ref LL_RTC_GetPrescalers
  * @retval Value of the synchronous prescaler
  */
#define LL_RTC_GET_SYNCH_PRESCALER(value) (((value) & RTC_PRER_PREDIV_S) >> RTC_PRER_PREDIV_S_Pos)

/**
  * @}
  */

/**
  * @brief  Helper macro to retrieve the value of BCD update.
  * @param  value Value returned by @ref LL_RTC_GetConfigBinaryMode
  * @retval Value of the BCD update in mixed mode
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_0
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_1
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_2
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_3
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_4
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_5
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_6
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_7
  */
#define LL_RTC_GET_BCDU(value) (((value) & RTC_ICSR_BCDU))

/**
  * @brief  Helper macro to retrieve the mode of RTC.
  * @param  value Value returned by @ref LL_RTC_GetConfigBinaryMode
  * @retval Mode of the RTC can be one of the value:
  *         @arg @ref LL_RTC_BINARY_NONE
  *         @arg @ref LL_RTC_BINARY_ONLY
  *         @arg @ref LL_RTC_BINARY_MIX
  */
#define LL_RTC_GET_BIN(value) (((value) & RTC_ICSR_BIN))

/** @defgroup RTC_LL_EM_Calendar Calendar helper macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve the calendar format value.
  * @param  value CR register value
  * @retval Mode of the RTC can be one of the value:
  *         @arg @ref LL_RTC_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_TIME_FORMAT_PM
  */
#define LL_RTC_GET_CALENDAR_HOUR_FORMAT(value) (((value) & RTC_CR_FMT))

/**
  * @brief Helper macro to retrieve the state of the bypass shadow register.
  * @param value CR register value
  * @retval Mode of the RTC can be one of the value:
  *        @arg @ref LL_RTC_SHADOW_REG_KEEP
  *        @arg @ref LL_RTC_SHADOW_REG_BYPASS
  */
#define LL_RTC_GET_SHADOW_REG_BYPASS(value) (((value) & RTC_CR_BYPSHAD))

/**
  * @}
  */

/** @defgroup RTC_LL_EM_Date Date helper Macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve weekday.
  * @param  rtc_date Date returned by @ref  LL_RTC_DATE_Get function
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  */
#define LL_RTC_GET_WEEKDAY(rtc_date) (((rtc_date) >> RTC_OFFSET_WEEKDAY) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve Year in BCD format.
  * @param  rtc_date Value returned by @ref  LL_RTC_DATE_Get
  * @retval Year in BCD format (0x00 . . . 0x99)
  */
#define LL_RTC_GET_YEAR(rtc_date) ((rtc_date) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve Month in BCD format.
  * @param  rtc_date Value returned by @ref  LL_RTC_DATE_Get
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_MONTH_JANUARY
  *         @arg @ref LL_RTC_MONTH_FEBRUARY
  *         @arg @ref LL_RTC_MONTH_MARCH
  *         @arg @ref LL_RTC_MONTH_APRIL
  *         @arg @ref LL_RTC_MONTH_MAY
  *         @arg @ref LL_RTC_MONTH_JUNE
  *         @arg @ref LL_RTC_MONTH_JULY
  *         @arg @ref LL_RTC_MONTH_AUGUST
  *         @arg @ref LL_RTC_MONTH_SEPTEMBER
  *         @arg @ref LL_RTC_MONTH_OCTOBER
  *         @arg @ref LL_RTC_MONTH_NOVEMBER
  *         @arg @ref LL_RTC_MONTH_DECEMBER
  */
#define LL_RTC_GET_MONTH(rtc_date) (((rtc_date) >>RTC_OFFSET_MONTH) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve Day in BCD format.
  * @param  rtc_date Value returned by @ref  LL_RTC_DATE_Get
  * @retval Day in BCD format (0x01 . . . 0x31)
  */
#define LL_RTC_GET_DAY(rtc_date) (((rtc_date) >>RTC_OFFSET_DAY) & 0x000000FFU)

/**
  * @}
  */

/** @defgroup RTC_LL_EM_Time Time helper Macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve hour in BCD format.
  * @param  rtc_time RTC time returned by @ref LL_RTC_TIME_Get function
  * @retval Hours in BCD format (0x01. . .0x12 or between Min_Data=0x00 and Max_Data=0x23)
  */
#define LL_RTC_GET_HOUR(rtc_time) (((rtc_time) >> RTC_OFFSET_HOUR) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve minute in BCD format.
  * @param  rtc_time RTC time returned by @ref LL_RTC_TIME_Get function
  * @retval Minutes in BCD format (0x00. . .0x59)
  */
#define LL_RTC_GET_MINUTE(rtc_time) (((rtc_time) >> RTC_OFFSET_MINUTE) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve second in BCD format.
  * @param  rtc_time RTC time returned by @ref LL_RTC_TIME_Get function
  * @retval Seconds in BCD format (0x00. . .0x59)
  */
#define LL_RTC_GET_SECOND(rtc_time) ((rtc_time) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve format.
  * @param  rtc_time RTC time returned by @ref LL_RTC_TIME_Get function
  * @retval Format
  */
#define LL_RTC_GET_FORMAT(rtc_time) (((rtc_time) >> RTC_OFFSET_FORMAT) & 0x0000000FU)

/**
  * @}
  */

/** @defgroup RTC_LL_EM_Output Output helper macros
  *  @{
  */

/**
  * @brief  Helper macro to retrieve the output polarity from the CR register.
  * @param  value CR register value
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_HIGH
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_LOW
  */
#define LL_RTC_GET_OUTPUT_POLARITY(value) (((value) & RTC_CR_TAMPALRM_TYPE) >> RTC_CR_TAMPALRM_TYPE_Pos)

/**
  * @brief  Helper macro to retrieve the output type from the CR register.
  * @param  value CR register value
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_PUSHPULL
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN
  */
#define LL_RTC_GET_OUTPUT_TYPE(value) (((value) & RTC_CR_TAMPALRM_TYPE) >> RTC_CR_TAMPALRM_TYPE_Pos)

/**
  * @brief  Helper macro to retrieve the output pull-up status from the CR register.
  * @param  value CR register value
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_OUTPUT_PULLUP_NONE
  *         @arg @ref LL_RTC_ALARM_OUTPUT_PULLUP_ON
  */
#define LL_RTC_GET_OUTPUT_PULLUP(value) (((value) & RTC_CR_POL) >> RTC_CR_POL_Pos)

/**
  * @}
  */

