MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/** @defgroup RTC_LL_EM_Alarm_Time alarm helper macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve alarm hour in BCD format.
  * @param  rtc_alarm_time_date Alarm time and date returned
  * @retval Hours in BCD format (0x01. . .0x12 or between Min_Data=0x00 and Max_Data=0x23)
  */
#define LL_RTC_GET_ALARM_HOUR(rtc_alarm_time_date) (((rtc_alarm_time_date) & \
                                                     (RTC_ALRMAR_HU_Msk | RTC_ALRMAR_HT_Msk)) >> RTC_ALRMAR_HU_Pos)

/**
  * @brief  Helper macro to retrieve alarm minute in BCD format.
  * @param  rtc_alarm_time_date Alarm time and date returned
  * @retval Minutes in BCD format (0x00. . .0x59)
  */
#define LL_RTC_GET_ALARM_MINUTE(rtc_alarm_time_date) (((rtc_alarm_time_date) & \
                                                       (RTC_ALRMAR_MNU_Msk | RTC_ALRMAR_MNT_Msk)) >>\
                                                      RTC_ALRMAR_MNU_Pos )

/**
  * @brief  Helper macro to retrieve alarm second in BCD format.
  * @param  rtc_alarm_time_date Alarm time and date returned
  * @retval Seconds in BCD format (0x00. . .0x59)
  */
#define LL_RTC_GET_ALARM_SECOND(rtc_alarm_time_date) (((rtc_alarm_time_date) & \
                                                       (RTC_ALRMAR_SU_Msk | RTC_ALRMAR_ST_Msk)) \
                                                      >> RTC_ALRMAR_SU_Pos )

/**
  * @brief  Helper macro to retrieve alarm time format.
  * @param  rtc_alarm_time_date Alarm time and date returned
  * @retval Format
  */
#define LL_RTC_GET_ALARM_FORMAT(rtc_alarm_time_date) (((rtc_alarm_time_date) & (RTC_ALRMAR_PM_Msk)))

/**
  * @brief  Helper macro to retrieve alarm day in BCD format.
  * @param  rtc_alarm_time_date Alarm time and date returned
  * @retval Day in BCD format (0x00. . .0x31)
  */
#define LL_RTC_GET_ALARM_DAY(rtc_alarm_time_date) (((rtc_alarm_time_date) & (RTC_ALRMAR_DU_Msk | RTC_ALRMAR_DT_Msk))\
                                                   >> RTC_ALRMAR_DU_Pos )

/**
  * @brief  Helper macro to retrieve alarm weekday selection in BCD format.
  * @param  rtc_alarm_time_date Alarm time and date returned
  * @retval Day weekday selection
  */
#define LL_RTC_GET_ALARM_DAY_WDAY_SEL(rtc_alarm_time_date) (((rtc_alarm_time_date) & (RTC_ALRMAR_WDSEL_Msk)))

/**
  * @brief  Helper macro to retrieve alarm mask selection in BCD format.
  * @param  rtc_alarm_time_date Alarm time and date returned
  * @retval Alarm mask selection
  */
#define LL_RTC_GET_ALARM_MASKS(rtc_alarm_time_date) ((rtc_alarm_time_date) & (RTC_ALRMAR_MSK4 | RTC_ALRMAR_MSK3 | \
                                                                              RTC_ALRMAR_MSK2 | RTC_ALRMAR_MSK1))

/**
  * @brief  Helper macro to retrieve alarm subsecond  in BCD format.
  * @param  rtc_alarm_ss Alarm subseconds mask and value returned
  * @retval Alarm subseconds
  */
#define LL_RTC_ALARM_GET_SS(rtc_alarm_ss) ((rtc_alarm_ss) & 0xFFFFU)

/**
  * @brief  Helper macro to retrieve alarm subsecond mask selection in BCD format.
  * @param  rtc_alarm_ss Alarm subseconds mask and value returned
  * @retval Alarm subseconds mask selection
  */
#define LL_RTC_ALARM_GET_MASK_SS(rtc_alarm_ss) (((rtc_alarm_ss)>> RTC_OFFSET_ALR_MASK_SUBS_SECONDS) & 0xFFU)

/**
  * @brief  Helper macro to retrieve the alarm A flag.
  * @param  rtc_flags Flags retrieved from RTC_SR register
  * @retval 0U when the alarm flag A is unset
  * @retval 1U when the alarm flag A is set
  */
#define LL_RTC_ALARM_A_GET_FLAG(rtc_flags) ((((rtc_flags) & RTC_SR_ALRAF) == RTC_SR_ALRAF) ? 1U : 0U)

/**
  * @brief  Helper macro to retrieve the alarm B flag.
  * @param  rtc_flags Flags retrieved from RTC_SR register
  * @retval 0U when the alarm flag B is unset
  * @retval 1U when the alarm flag B is set
  */
#define LL_RTC_ALARM_B_GET_FLAG(rtc_flags) ((((rtc_flags) & RTC_SR_ALRBF) == RTC_SR_ALRBF) ? 1U : 0U)

/**
  * @brief  Helper macro to retrieve the wake-up timer flag.
  * @param  rtc_flags Flags retrieved from RTC_SR
  * @retval 0U when the wake-up timer flag is unset
  * @retval 1U when the wake-up timer flag is set
  */
#define LL_RTC_WAKEUP_GET_FLAG(rtc_flags) ((((rtc_flags) & RTC_SR_WUTF) == RTC_SR_WUTF) ? 1U : 0U)
/**
  * @brief  Helper macro to retrieve the timestamp flag.
  * @param  rtc_flags Timestamp flags retrieved from RTC_SR
  * @retval 0U when the timestamp is unset
  * @retval 1U when the timestamp is set
  */
#define LL_RTC_TIMESTAMP_GET_FLAG(rtc_flags) ((((rtc_flags) & RTC_SR_TSF) == RTC_SR_TSF) ? 1U : 0U)

/**
  * @brief  Helper macro to retrieve the SSR underflow flag.
  * @param  rtc_flags SSRU flags retrieved from RTC_SR
  * @retval 0U when the SRRU flag is unset
  * @retval 1U when the SRRU flag is set
  */
#define LL_RTC_SSRU_GET_FLAG(rtc_flags) ((((rtc_flags) & RTC_SR_SSRUF) == RTC_SR_SSRUF) ? 1U : 0U)

/**
  * @}
  */

/** @defgroup RTC_LL_EM_Wakeup_Time Wake-up timer helper macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve the value of the wake-up auto-reload value.
  * @param  value WUTR register value
  * @retval Returned value between 0x0 and 0xFFFF
  */
#define LL_RTC_GET_WAKEUP_AUTORELOAD(value) (((value) & RTC_WUTR_WUT) >> RTC_WUTR_WUT_Pos)

/**
  * @brief  Helper macro to retrieve the value of the auto-clear value.
  * @param  value WUTR register value
  * @retval Returned value between 0x0 and 0xFFFF
  */
#define LL_RTC_GET_WAKEUP_AUTOCLEAR(value) (((value) & RTC_WUTR_WUTOCLR) >> RTC_WUTR_WUTOCLR_Pos)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup RTC_LL_Exported_Functions LL RTC Functions
  * @{
  */

/** @defgroup RTC_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Set Hours format (24 hour/day or AM/PM hour format).
  * @rmtoll
  *  RTC_CR           FMT           LL_RTC_SetHourFormat
  * @param  HourFormat This parameter can be one of the following values:
  *         @arg @ref LL_RTC_HOUR_FORMAT_24HOUR
  *         @arg @ref LL_RTC_HOUR_FORMAT_AMPM
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_SetHourFormat(uint32_t HourFormat)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_FMT, HourFormat);
}

/**
  * @brief  Get Hours format (24 hour/day or AM/PM hour format).
  * @rmtoll
  *  RTC_CR           FMT           LL_RTC_GetHourFormat
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_HOUR_FORMAT_24HOUR
  *         @arg @ref LL_RTC_HOUR_FORMAT_AMPM
  */
__STATIC_INLINE uint32_t LL_RTC_GetHourFormat(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, RTC_CR_FMT));
}

/**
  * @brief  Select the flag to be routed to RTC_ALARM output.
  * @rmtoll
  *  RTC_CR           OSEL          LL_RTC_SetAlarmOutEvent
  * @param  AlarmOutput This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARMOUT_DISABLE
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_A
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_B
  *         @arg @ref LL_RTC_ALARMOUT_WAKEUP
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_SetAlarmOutEvent(uint32_t AlarmOutput)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_OSEL, AlarmOutput);
}

/**
  * @brief  Get the flag to be routed to RTC_ALARM output.
  * @rmtoll
  *  RTC_CR           OSEL          LL_RTC_GetAlarmOutEvent
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALARMOUT_DISABLE
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_A
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_B
  *         @arg @ref LL_RTC_ALARMOUT_WAKEUP
  */
__STATIC_INLINE uint32_t LL_RTC_GetAlarmOutEvent(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, RTC_CR_OSEL));
}

/**
  * @brief  Set RTC_ALARM output type (ALARM in push-pull or open-drain output).
  * @rmtoll
  *  RTC_CR           TAMPALRM_TYPE          LL_RTC_SetAlarmOutputType
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_PUSHPULL
  */
__STATIC_INLINE void LL_RTC_SetAlarmOutputType(uint32_t Output)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_TAMPALRM_TYPE, Output);
}

/**
  * @brief  Get RTC_ALARM output type (ALARM in push-pull or open-drain output).
  * @rmtoll
  *  RTC_CR           TAMPALRM_TYPE          LL_RTC_GetAlarmOutputType
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_PUSHPULL
  */
__STATIC_INLINE uint32_t LL_RTC_GetAlarmOutputType(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, RTC_CR_TAMPALRM_TYPE));
}

/**
  * @brief  Enable initialization mode.
  * @rmtoll
  *  RTC_ICSR          INIT          LL_RTC_EnableInitMode
  * @note   Initialization mode is used to program time and date register (RTC_TR and RTC_DR)
  *         and prescaler register (RTC_PRER)
  *         Counters are stopped and start counting from the new value when INIT is reset
  */
__STATIC_INLINE void LL_RTC_EnableInitMode(void)
{
  /* Set the Initialization mode */
  STM32_SET_BIT(RTC->ICSR, RTC_ICSR_INIT);
}

/**
  * @brief  Disable initialization mode (Free-running mode).
  * @rmtoll
  *  RTC_ICSR          INIT          LL_RTC_DisableInitMode
  */
__STATIC_INLINE void LL_RTC_DisableInitMode(void)
{
  /* Exit Initialization mode */
  STM32_CLEAR_BIT(RTC->ICSR, RTC_ICSR_INIT);

