MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
}

/**
  * @brief  Set Binary mode (Sub Second Register).
  * @rmtoll
  *  RTC_ICSR           BIN           LL_RTC_SetBinaryMode
  * @param  BinaryMode can be one of the following values:
  *         @arg @ref LL_RTC_BINARY_NONE
  *         @arg @ref LL_RTC_BINARY_ONLY
  *         @arg @ref LL_RTC_BINARY_MIX
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_SetBinaryMode(uint32_t BinaryMode)
{
  STM32_MODIFY_REG(RTC->ICSR, RTC_ICSR_BIN, BinaryMode);
}

/**
  * @brief  Get Binary mode (Sub Second Register).
  * @rmtoll
  *  RTC_ICSR           BIN           LL_RTC_GetBinaryMode
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_RTC_BINARY_NONE
  *         @arg @ref LL_RTC_BINARY_ONLY
  *         @arg @ref LL_RTC_BINARY_MIX
  */
__STATIC_INLINE uint32_t LL_RTC_GetBinaryMode(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ICSR, RTC_ICSR_BIN));
}

/**
  * @brief  Set Binary Mix mode BCDU.
  * @rmtoll
  *  RTC_ICSR           BCDU          LL_RTC_SetBinMixBCDU
  * @param  BinMixBcdU can be one of the following values:
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_0
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_1
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_2
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_3
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_4
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_5
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_6
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_7
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_SetBinMixBCDU(uint32_t BinMixBcdU)
{
  STM32_MODIFY_REG(RTC->ICSR, RTC_ICSR_BCDU, BinMixBcdU);
}

/**
  * @brief  Get Binary Mix mode BCDU.
  * @rmtoll
  *  RTC_ICSR           BCDU          LL_RTC_GetBinMixBCDU
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_0
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_1
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_2
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_3
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_4
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_5
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_6
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_7
  */
__STATIC_INLINE uint32_t LL_RTC_GetBinMixBCDU(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ICSR, RTC_ICSR_BCDU));
}

/**
  * @brief  Set Binary mode (Sub Second Register) and Mix mode BCDU.
  * @rmtoll
  *  RTC_ICSR           BIN           LL_RTC_SetConfigBinaryMode \n
  *  RTC_ICSR           BCDU          LL_RTC_SetConfigBinaryMode
  * @param  BinaryMode can be one of the following values:
  *         @arg @ref LL_RTC_BINARY_NONE
  *         @arg @ref LL_RTC_BINARY_ONLY
  *         @arg @ref LL_RTC_BINARY_MIX
  * @param  BinMixBcdU can be one of the following values:
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_0
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_1
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_2
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_3
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_4
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_5
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_6
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_7
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_SetConfigBinaryMode(uint32_t BinaryMode, uint32_t BinMixBcdU)
{
  STM32_MODIFY_REG(RTC->ICSR, RTC_ICSR_BIN | RTC_ICSR_BCDU, BinaryMode | BinMixBcdU);
}

/**
  * @brief  Get Binary mode (Sub Second Register) and Mix mode BCDU.
  * @rmtoll
  *  RTC_ICSR           BIN           LL_RTC_GetConfigBinaryMode \n
  *  RTC_ICSR           BCDU          LL_RTC_GetConfigBinaryMode
  * @retval  A combination one of the following values:
  *         @arg @ref LL_RTC_BINARY_NONE
  *         @arg @ref LL_RTC_BINARY_ONLY
  *         @arg @ref LL_RTC_BINARY_MIX
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_0
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_1
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_2
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_3
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_4
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_5
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_6
  *         @arg @ref LL_RTC_BINARY_MIX_BCDU_7
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE uint32_t LL_RTC_GetConfigBinaryMode(void)
{
  return (uint32_t) STM32_READ_BIT(RTC->ICSR, RTC_ICSR_BIN | RTC_ICSR_BCDU);
}

/**
  * @brief  Set Output polarity.
  * @rmtoll
  *  RTC_CR           POL           LL_RTC_SetOutputPolarity
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_HIGH
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_LOW
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_SetOutputPolarity(uint32_t Polarity)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_POL, Polarity);
}

/**
  * @brief  Get Output polarity.
  * @rmtoll
  *  RTC_CR           POL           LL_RTC_GetOutputPolarity
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_HIGH
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_LOW
  */
__STATIC_INLINE uint32_t LL_RTC_GetOutputPolarity(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, RTC_CR_POL));
}

/**
  * @brief  Enable bypass of the shadow registers.
  * @rmtoll
  *  RTC_CR           BYPSHAD       LL_RTC_EnableBypassShadowReg
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   When bypass enable, Calendar values (when reading from RTC_SSR, RTC_TR, and RTC_DR) are taken
  *         directly from the calendar counters
  * @note   If the frequency of the APB clock is less than seven times the frequency of RTCCLK,
  *         BYPSHAD must be set to 1
  */
__STATIC_INLINE void LL_RTC_EnableBypassShadowReg(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_BYPSHAD);
}

/**
  * @brief  Disable bypass of the shadow registers.
  * @rmtoll
  *  RTC_CR           BYPSHAD       LL_RTC_DisableBypassShadowReg
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_DisableBypassShadowReg(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_BYPSHAD);
}

/**
  * @brief  Check if the bypass of the shadow registers is enabled or not.
  * @rmtoll
  *  RTC_CR           BYPSHAD       LL_RTC_IsEnabledBypassShadowReg
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledBypassShadowReg(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_BYPSHAD) == (RTC_CR_BYPSHAD)) ? 1UL : 0UL);
}

/**
  * @brief  Set Hours format (24 hour/day or AM/PM hour format) and bypass shadow registers.
  * @rmtoll
  *  RTC_CR           FMT           LL_RTC_SetHourFormatAndShadowRegBypass \n
  *  RTC_CR           BYPSHAD       LL_RTC_SetHourFormatAndShadowRegBypass
  * @param  HourFormat This parameter can be one of the following values:
  *         @arg @ref LL_RTC_HOUR_FORMAT_24HOUR
  *         @arg @ref LL_RTC_HOUR_FORMAT_AMPM
  * @param  Bypass This parameter can be one of the following values:
  *         @arg @ref LL_RTC_SHADOW_REG_KEEP
  *         @arg @ref LL_RTC_SHADOW_REG_BYPASS
  * @note   Bits are write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_SetHourFormatAndShadowRegBypass(uint32_t HourFormat, uint32_t Bypass)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_FMT | RTC_CR_BYPSHAD, HourFormat | Bypass);
}

/**
  * @brief  Enable RTC_REFIN reference clock detection (50 or 60 Hz).
  * @rmtoll
  *  RTC_CR           REFCKON       LL_RTC_EnableRefClock
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_EnableRefClock(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_REFCKON);
}

/**
  * @brief  Disable RTC_REFIN reference clock detection (50 or 60 Hz).
  * @rmtoll
  *  RTC_CR           REFCKON       LL_RTC_DisableRefClock
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_DisableRefClock(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_REFCKON);
}

/**
  * @brief  Check if reference clock is enabled or not.
  * @rmtoll
  *  RTC_CR           REFCKON       LL_RTC_IsEnabledRefClock
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledRefClock(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_REFCKON) == (RTC_CR_REFCKON)) ? 1UL : 0UL);
}

/**
  * @brief  Set the different prescalers factor.
  * @rmtoll
  *  RTC_PRER         PREDIV_A      LL_RTC_SetPrescalers \n
  *  RTC_PRER         PREDIV_S      LL_RTC_SetPrescalers
  * @param  AsynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7F
  * @param  SynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7FFF
  */
__STATIC_INLINE void LL_RTC_SetPrescalers(uint32_t AsynchPrescaler, uint32_t SynchPrescaler)
{
  STM32_WRITE_REG(RTC->PRER, (SynchPrescaler | (AsynchPrescaler << RTC_PRER_PREDIV_A_Pos)));
}

/**
  * @brief  Get the different prescalers factor.
  * @rmtoll
  *  RTC_PRER         PREDIV_A      LL_RTC_GetPrescalers \n
  *  RTC_PRER         PREDIV_S      LL_RTC_GetPrescalers
  * @retval AsynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7F and
  *         SynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7FFF
  */
__STATIC_INLINE uint32_t LL_RTC_GetPrescalers(void)
{
  return STM32_READ_REG(RTC->PRER);
}

/**
  * @brief  Set Asynchronous prescaler factor.
  * @rmtoll
  *  RTC_PRER         PREDIV_A      LL_RTC_SetAsynchPrescaler
  * @param  AsynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7F
  */
__STATIC_INLINE void LL_RTC_SetAsynchPrescaler(uint32_t AsynchPrescaler)
{
  STM32_MODIFY_REG(RTC->PRER, RTC_PRER_PREDIV_A, AsynchPrescaler << RTC_PRER_PREDIV_A_Pos);
}

/**
  * @brief  Set Synchronous prescaler factor.
  * @rmtoll
  *  RTC_PRER         PREDIV_S      LL_RTC_SetSynchPrescaler
  * @param  SynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7FFF
  */
__STATIC_INLINE void LL_RTC_SetSynchPrescaler(uint32_t SynchPrescaler)
{
  STM32_MODIFY_REG(RTC->PRER, RTC_PRER_PREDIV_S, SynchPrescaler);
}

/**
  * @brief  Get Asynchronous prescaler factor.
  * @rmtoll
  *  RTC_PRER         PREDIV_A      LL_RTC_GetAsynchPrescaler
  * @retval Value between Min_Data = 0 and Max_Data = 0x7F
  */
__STATIC_INLINE uint32_t LL_RTC_GetAsynchPrescaler(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->PRER, RTC_PRER_PREDIV_A) >> RTC_PRER_PREDIV_A_Pos);
}

/**
  * @brief  Get Synchronous prescaler factor.
  * @rmtoll
  *  RTC_PRER         PREDIV_S      LL_RTC_GetSynchPrescaler
  * @retval Value between Min_Data = 0 and Max_Data = 0x7FFF
  */
__STATIC_INLINE uint32_t LL_RTC_GetSynchPrescaler(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->PRER, RTC_PRER_PREDIV_S));
}

/**
  * @brief  Enable the write protection for RTC registers.
  * @rmtoll
  *  RTC_WPR          KEY           LL_RTC_EnableWriteProtection
  */
__STATIC_INLINE void LL_RTC_EnableWriteProtection(void)
{
  STM32_WRITE_REG(RTC->WPR, RTC_WRITE_PROTECTION_DISABLE);
}

/**
  * @brief  Disable the write protection for RTC registers.
  * @rmtoll
  *  RTC_WPR          KEY           LL_RTC_DisableWriteProtection
  */
__STATIC_INLINE void LL_RTC_DisableWriteProtection(void)
{
  STM32_WRITE_REG(RTC->WPR, RTC_WRITE_PROTECTION_ENABLE_1);
  STM32_WRITE_REG(RTC->WPR, RTC_WRITE_PROTECTION_ENABLE_2);
}

/**
  * @brief  Enable tamper output.
  * @rmtoll
  *  RTC_CR           TAMPOE       LL_RTC_EnableTamperOutput
  * @note   When the tamper output is enabled, all external and internal tamper flags
  *         are ORed and routed to the TAMPALRM output
  */
__STATIC_INLINE void LL_RTC_EnableTamperOutput(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_TAMPOE);
}

/**
  * @brief  Disable tamper output.
  * @rmtoll
  *  RTC_CR           TAMPOE       LL_RTC_DisableTamperOutput
  */
__STATIC_INLINE void LL_RTC_DisableTamperOutput(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_TAMPOE);
}

/**
  * @brief  Check if tamper output is enabled or not.
  * @rmtoll
  *  RTC_CR           TAMPOE       LL_RTC_IsEnabledTamperOutput
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledTamperOutput(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_TAMPOE) == (RTC_CR_TAMPOE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable internal pull-up in output mode.
  * @rmtoll
  *  RTC_CR           TAMPALRM_PU       LL_RTC_EnableAlarmPullUp
  */
__STATIC_INLINE void LL_RTC_EnableAlarmPullUp(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_TAMPALRM_PU);
}

/**
  * @brief  Disable internal pull-up in output mode.
  * @rmtoll
  *  RTC_CR           TAMPALRM_PU       LL_RTC_DisableAlarmPullUp
  */
__STATIC_INLINE void LL_RTC_DisableAlarmPullUp(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_TAMPALRM_PU);
}

/**
  * @brief  Check if internal pull-up in output mode is enabled or not.
  * @rmtoll
  *  RTC_CR           TAMPALRM_PU       LL_RTC_IsEnabledAlarmPullUp
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledAlarmPullUp(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_TAMPALRM_PU) == (RTC_CR_TAMPALRM_PU)) ? 1UL : 0UL);
}

/**
  * @brief  Enable RTC_OUT2 output.
  * @rmtoll
  *  RTC_CR           OUT2EN       LL_RTC_EnableOutput2
  * @note   RTC_OUT2 mapping depends on both OSEL (@ref LL_RTC_SetAlarmOutEvent)
  *         and COE (@ref LL_RTC_CAL_SetOutputFreq) settings
  */
__STATIC_INLINE void LL_RTC_EnableOutput2(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_OUT2EN);
}

/**
  * @brief  Disable RTC_OUT2 output.
  * @rmtoll
  *  RTC_CR           OUT2EN       LL_RTC_DisableOutput2
  */
__STATIC_INLINE void LL_RTC_DisableOutput2(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_OUT2EN);
}

/**
  * @brief  Check if RTC_OUT2 output is enabled or not.
  * @rmtoll
  *  RTC_CR           OUT2EN       LL_RTC_IsEnabledOutput2
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledOutput2(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_OUT2EN) == (RTC_CR_OUT2EN)) ? 1UL : 0UL);
}


/**
  * @brief  Enable the output of the calibration signal or tampalarm signal.
  * @rmtoll
  *  RTC_CR        OUT2EN        LL_RTC_EnableOutput \n
  *  RTC_CR        TAMPOE        LL_RTC_EnableOutput \n
  *  RTC_CR        OSEL          LL_RTC_EnableOutput \n
  *  RTC_CR        COE           LL_RTC_EnableOutput \n
  *  RTC_CR        COSEL         LL_RTC_EnableOutput
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_A
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_B
  *         @arg @ref LL_RTC_ALARM_OUTPUT_REMAP_POS1
  *         @arg @ref LL_RTC_ALARMOUT_WAKEUP
  *         @arg @ref LL_RTC_OUTPUT_TAMPER_ENABLE
  *         @arg @ref LL_RTC_CALIB_OUTPUT_1HZ
  *         @arg @ref LL_RTC_CALIB_OUTPUT_512HZ
  */
__STATIC_INLINE void LL_RTC_EnableOutput(uint32_t Output)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_OUT2EN | RTC_CR_TAMPOE | RTC_CR_OSEL_0 | RTC_CR_OSEL_1 | RTC_CR_COE | RTC_CR_COSEL,
                   Output);
}

/**
  * @brief  Disable the output of the calibration signal or tampalarm signal.
  * @rmtoll
  *  RTC_CR              OUT2EN        LL_RTC_DisableOutput \n
  *  RTC_CR              TAMPOE        LL_RTC_DisableOutput \n
  *  RTC_CR              OSEL          LL_RTC_DisableOutput \n
  *  RTC_CR              COE           LL_RTC_DisableOutput \n
  *  RTC_CR              COSEL         LL_RTC_DisableOutput
  */
__STATIC_INLINE void LL_RTC_DisableOutput(void)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_OUT2EN | RTC_CR_TAMPOE | RTC_CR_OSEL_0 | RTC_CR_OSEL_1 | RTC_CR_COE | RTC_CR_COSEL,
                   0U);
}

/**
  * @brief  Get the output status of the calibration signal or tampalarm signal.
  * @rmtoll
  *  RTC_CR              OUT2EN        LL_RTC_IsEnabledOutput \n
  *  RTC_CR              TAMPOE        LL_RTC_IsEnabledOutput \n
  *  RTC_CR              OSEL          LL_RTC_IsEnabledOutput \n
  *  RTC_CR              COE           LL_RTC_IsEnabledOutput \n
  *  RTC_CR              COSEL         LL_RTC_IsEnabledOutput
  * @retval 0 output disabled
  * @retval 1 output enabled
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledOutput(void)
{
  return (((STM32_READ_REG(RTC->CR) & (RTC_CR_OUT2EN | RTC_CR_TAMPOE | RTC_CR_OSEL_0 | RTC_CR_OSEL_1 | RTC_CR_COE |
                                       RTC_CR_COSEL)) == 0U) ? 0UL : 1UL);
}

/**
  * @brief  Get the output detailed status of the calibration signal or tampalarm signal.
  * @rmtoll
  *  RTC_CR              OUT2EN        LL_RTC_IsEnabledDetailedOutput \n
  *  RTC_CR              AMPOE         LL_RTC_IsEnabledDetailedOutput \n
  *  RTC_CR              OSEL          LL_RTC_IsEnabledDetailedOutput \n
  *  RTC_CR              COE           LL_RTC_IsEnabledDetailedOutput \n
  *  RTC_CR              COSEL         LL_RTC_IsEnabledDetailedOutput
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_A
  *         @arg @ref LL_RTC_ALARMOUT_ALARM_B
  *         @arg @ref LL_RTC_ALARM_OUTPUT_REMAP_POS1
  *         @arg @ref LL_RTC_ALARMOUT_WAKEUP
  *         @arg @ref LL_RTC_OUTPUT_TAMPER_ENABLE
  *         @arg @ref LL_RTC_CALIB_OUTPUT_1HZ
  *         @arg @ref LL_RTC_CALIB_OUTPUT_512HZ
  * @retval 0 output disabled, 1 output enabled
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledDetailedOutput(const uint32_t Output)
{
  return (((STM32_READ_REG(RTC->CR) & (RTC_CR_OUT2EN | RTC_CR_TAMPOE | RTC_CR_OSEL_0 | RTC_CR_OSEL_1 |
                                       RTC_CR_COE | RTC_CR_COSEL)) == Output) ? 1UL : 0UL);
}

/**
  * @brief  Configure the Output polarity and pull-up.
  * @rmtoll
  *  RTC_CR           POL                      LL_RTC_ConfigTampalarm \n
  *  RTC_CR           TAMPALRM_TYPE            LL_RTC_ConfigTampalarm \n
  *  RTC_CR           TAMPALRM_PU              LL_RTC_ConfigTampalarm
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_HIGH
  *         @arg @ref LL_RTC_OUTPUTPOLARITY_PIN_LOW
  * @param  Type This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN
  *         @arg @ref LL_RTC_ALARM_OUTPUTTYPE_PUSHPULL
  * @param  PullUp This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_OUTPUT_PULLUP_NONE
  *         @arg @ref LL_RTC_ALARM_OUTPUT_PULLUP_ON
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_ConfigTampalarm(uint32_t Polarity,
                                            uint32_t Type, uint32_t PullUp)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_POL | RTC_CR_TAMPALRM_TYPE | RTC_CR_TAMPALRM_PU, Polarity | Type | PullUp);
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_Time Time
  * @{
  */

/**
  * @brief  Set time format (AM/24-hour or PM notation).
  * @rmtoll
  *  RTC_TR           PM            LL_RTC_TIME_SetFormat
  * @param  TimeFormat This parameter can be one of the following values:
  *         @arg @ref LL_RTC_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_TIME_FORMAT_PM
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  */
__STATIC_INLINE void LL_RTC_TIME_SetFormat(uint32_t TimeFormat)
{
  STM32_MODIFY_REG(RTC->TR, RTC_TR_PM, TimeFormat);
}

/**
  * @brief  Get time format (AM/24-hour or PM notation).
  * @rmtoll
  *  RTC_TR           PM            LL_RTC_TIME_GetFormat
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_TIME_FORMAT_PM
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   Read either RTC_SSR or RTC_TR locks the values in the higher-order calendar
  *         shadow registers until RTC_DR is read (LL_RTC_READ_REG(DR))
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_GetFormat(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TR, RTC_TR_PM));
}

/**
  * @brief  Set Hours in BCD format.
  * @rmtoll
  *  RTC_TR           HT            LL_RTC_TIME_SetHour \n
  *  RTC_TR           HU            LL_RTC_TIME_SetHour
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert hour from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_TIME_SetHour(uint32_t Hours)
{
  STM32_MODIFY_REG(RTC->TR, (RTC_TR_HT | RTC_TR_HU),
                   (((Hours & 0xF0U) << (RTC_TR_HT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_TR_HU_Pos)));
}

/**
  * @brief  Get Hours in BCD format.
  * @rmtoll
  *  RTC_TR           HT            LL_RTC_TIME_GetHour \n
  *  RTC_TR           HU            LL_RTC_TIME_GetHour
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   Read either RTC_SSR or RTC_TR locks the values in the higher-order calendar
  *         shadow registers until RTC_DR is read (LL_RTC_READ_REG(DR))
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert hour from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_GetHour(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->TR, (RTC_TR_HT | RTC_TR_HU))) >> RTC_TR_HU_Pos);
}

/**
  * @brief  Set Minutes in BCD format.
  * @rmtoll
  *  RTC_TR           MNT           LL_RTC_TIME_SetMinute \n
  *  RTC_TR           MNU           LL_RTC_TIME_SetMinute
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Minutes from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_TIME_SetMinute(uint32_t Minutes)
{
  STM32_MODIFY_REG(RTC->TR, (RTC_TR_MNT | RTC_TR_MNU),
                   (((Minutes & 0xF0U) << (RTC_TR_MNT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_TR_MNU_Pos)));
}

