MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/**
  * @brief  Get Minutes in BCD format.
  * @rmtoll
  *  RTC_TR           MNT           LL_RTC_TIME_GetMinute \n
  *  RTC_TR           MNU           LL_RTC_TIME_GetMinute
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   Read either RTC_SSR or RTC_TR locks the values in the higher-order calendar
  *         shadow registers until RTC_DR is read (LL_RTC_READ_REG(DR))
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert minute from BCD
  *         to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_GetMinute(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TR, (RTC_TR_MNT | RTC_TR_MNU)) >> RTC_TR_MNU_Pos);
}

/**
  * @brief  Set Seconds in BCD format.
  * @rmtoll
  *  RTC_TR           ST            LL_RTC_TIME_SetSecond \n
  *  RTC_TR           SU            LL_RTC_TIME_SetSecond
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Seconds from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_TIME_SetSecond(uint32_t Seconds)
{
  STM32_MODIFY_REG(RTC->TR, (RTC_TR_ST | RTC_TR_SU),
                   (((Seconds & 0xF0U) << (RTC_TR_ST_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_TR_SU_Pos)));
}

/**
  * @brief  Get Seconds in BCD format.
  * @rmtoll
  *  RTC_TR           ST            LL_RTC_TIME_GetSecond \n
  *  RTC_TR           SU            LL_RTC_TIME_GetSecond
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   Read either RTC_SSR or RTC_TR locks the values in the higher-order calendar
  *         shadow registers until RTC_DR is read (LL_RTC_READ_REG(DR))
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Seconds from BCD
  *         to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_GetSecond(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TR, (RTC_TR_ST | RTC_TR_SU)) >> RTC_TR_SU_Pos);
}

/**
  * @brief  Set time (hour, minute and second) in BCD format.
  * @rmtoll
  *  RTC_TR           PM            LL_RTC_TIME_Config \n
  *  RTC_TR           HT            LL_RTC_TIME_Config \n
  *  RTC_TR           HU            LL_RTC_TIME_Config \n
  *  RTC_TR           MNT           LL_RTC_TIME_Config \n
  *  RTC_TR           MNU           LL_RTC_TIME_Config \n
  *  RTC_TR           ST            LL_RTC_TIME_Config \n
  *  RTC_TR           SU            LL_RTC_TIME_Config
  * @param  Format12_24 This parameter can be one of the following values:
  *         @arg @ref LL_RTC_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_TIME_FORMAT_PM
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnableInitMode function)
  * @note   TimeFormat and Hours must preferably follow the same format
  */
__STATIC_INLINE void LL_RTC_TIME_Config(uint32_t Format12_24, uint32_t Hours, uint32_t Minutes,
                                        uint32_t Seconds)
{
  uint32_t temp;

  temp = Format12_24                                                                                    | \
         (((Hours & 0xF0U) << (RTC_TR_HT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_TR_HU_Pos))     | \
         (((Minutes & 0xF0U) << (RTC_TR_MNT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_TR_MNU_Pos)) | \
         (((Seconds & 0xF0U) << (RTC_TR_ST_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_TR_SU_Pos));
  STM32_WRITE_REG(RTC->TR, temp);
}

/**
  * @brief  Get time (hour, minute and second) in BCD format.
  * @rmtoll
  *  RTC_TR           HT            LL_RTC_TIME_Get \n
  *  RTC_TR           HU            LL_RTC_TIME_Get \n
  *  RTC_TR           MNT           LL_RTC_TIME_Get \n
  *  RTC_TR           MNU           LL_RTC_TIME_Get \n
  *  RTC_TR           ST            LL_RTC_TIME_Get \n
  *  RTC_TR           SU            LL_RTC_TIME_Get
  * @retval Combination of hours, minutes and seconds (Format: 0x00HHMMSS)
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   Read either RTC_SSR or RTC_TR locks the values in the higher-order calendar
  *         shadow registers until RTC_DR is read (LL_RTC_READ_REG(DR))
  * @note   helper macros LL_RTC_GET_HOUR, LL_RTC_GET_MINUTE and LL_RTC_GET_SECOND
  *         are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_Get(void)
{
  uint32_t temp;

  temp = STM32_READ_BIT(RTC->TR, (RTC_TR_HT | RTC_TR_HU | RTC_TR_MNT | RTC_TR_MNU | RTC_TR_ST | RTC_TR_SU));
  return (uint32_t)((((((temp & RTC_TR_HT) >> RTC_TR_HT_Pos) << 4U) | ((temp & RTC_TR_HU) >> RTC_TR_HU_Pos)) \
                     << RTC_OFFSET_HOUR) | (((((temp & RTC_TR_MNT) >> RTC_TR_MNT_Pos) << 4U) | \
                                             ((temp & RTC_TR_MNU) >> RTC_TR_MNU_Pos)) << RTC_OFFSET_MINUTE) | \
                    ((((temp & RTC_TR_ST) >> RTC_TR_ST_Pos) << 4U) | ((temp & RTC_TR_SU) >> RTC_TR_SU_Pos)));
}

/**
  * @brief  Get time (hour, minute and second) in BCD format and time format.
  * @rmtoll
  *  RTC_TR        PM            LL_RTC_TIME_GetTimeAndFormat \n
  *  RTC_TR        HT            LL_RTC_TIME_GetTimeAndFormat \n
  *  RTC_TR        HU            LL_RTC_TIME_GetTimeAndFormat \n
  *  RTC_TR        MNT           LL_RTC_TIME_GetTimeAndFormat \n
  *  RTC_TR        MNU           LL_RTC_TIME_GetTimeAndFormat \n
  *  RTC_TR        ST            LL_RTC_TIME_GetTimeAndFormat \n
  *  RTC_TR        SU            LL_RTC_TIME_GetTimeAndFormat
  * @retval Combination of format, hours, minutes and seconds (Format: 0x0FHHMMSS)
  * @note   helper macros LL_RTC_GET_FORMAT LL_RTC_GET_HOUR, LL_RTC_GET_MINUTE
  *         and LL_RTC_GET_SECOND are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_GetTimeAndFormat(void)
{
  uint32_t temp;

  temp = STM32_READ_REG(RTC->TR);
  return (uint32_t)((((temp & RTC_TR_PM) >> RTC_TR_PM_Pos) << RTC_OFFSET_FORMAT) | \
                    (((((temp & RTC_TR_HT) >> RTC_TR_HT_Pos) << 4U) | ((temp & RTC_TR_HU) >> RTC_TR_HU_Pos)) \
                     << RTC_OFFSET_HOUR) | (((((temp & RTC_TR_MNT) >> RTC_TR_MNT_Pos) << 4U) | \
                                             ((temp & RTC_TR_MNU) >> RTC_TR_MNU_Pos)) << RTC_OFFSET_MINUTE) | \
                    ((((temp & RTC_TR_ST) >> RTC_TR_ST_Pos) << 4U) | ((temp & RTC_TR_SU) >> RTC_TR_SU_Pos)));
}

/**
  * @brief  Memorize whether the daylight saving time change has been performed.
  * @rmtoll
  *  RTC_CR           BKP           LL_RTC_TIME_EnableDayLightStore
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_TIME_EnableDayLightStore(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_BKP);
}

/**
  * @brief  Disable memorization whether the daylight saving time change has been performed.
  * @rmtoll
  *  RTC_CR           BKP           LL_RTC_TIME_DisableDayLightStore
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_TIME_DisableDayLightStore(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_BKP);
}

/**
  * @brief  Check if RTC Day Light Saving stored operation is enabled or not.
  * @rmtoll
  *  RTC_CR           BKP           LL_RTC_TIME_IsEnabledDayLightStore
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_IsEnabledDayLightStore(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_BKP) == (RTC_CR_BKP)) ? 1UL : 0UL);
}

/**
  * @brief  Subtract 1 hour (winter time change).
  * @rmtoll
  *  RTC_CR           SUB1H         LL_RTC_TIME_DecHour
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_TIME_DecHour(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_SUB1H);
}

/**
  * @brief  Add 1 hour (summer time change).
  * @rmtoll
  *  RTC_CR           ADD1H         LL_RTC_TIME_IncHour
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_TIME_IncHour(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_ADD1H);
}

/**
  * @brief  Get Sub second value in the synchronous prescaler counter.
  * @rmtoll
  *  RTC_SSR          SS            LL_RTC_TIME_GetSubSecond
  * @retval If binary mode is none, Value between Min_Data=0x0 and Max_Data=0x7FFF
  *         else Value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  * @note   Use both SubSeconds value and SecondFraction (PREDIV_S through the
  *         LL_RTC_GetSynchPrescaler function) terms returned to convert the calendar
  *         SubSeconds value to a second fraction ratio with the following time unit formula:
  *         ==> Seconds fraction ratio * time_unit= [(SecondFraction-SubSeconds)/(SecondFraction+1)] * time_unit
  *         This conversion can be performed only if no shift operation is pending (ie. SHFP=0) when PREDIV_S >= SS
  */
__STATIC_INLINE uint32_t LL_RTC_TIME_GetSubSecond(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->SSR, RTC_SSR_SS));
}

/**
  * @brief  Synchronize to a remote clock with a high degree of precision.
  * @rmtoll
  *  RTC_SHIFTR       ADD1S         LL_RTC_TIME_Synchronize \n
  *  RTC_SHIFTR       SUBFS         LL_RTC_TIME_Synchronize
  * @param  ShiftSecond This parameter can be one of the following values:
  *         @arg @ref LL_RTC_SHIFT_SECOND_DELAY
  *         @arg @ref LL_RTC_SHIFT_SECOND_ADVANCE
  * @param  Fraction Number of Seconds Fractions (any value from 0 to 0x7FFF)
  * @note   This operation effectively subtracts from (delays) or advance the clock of a fraction of a second
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  * @note   When REFCKON is set, firmware must not write to Shift control register
  */
__STATIC_INLINE void LL_RTC_TIME_Synchronize(uint32_t ShiftSecond, uint32_t Fraction)
{
  STM32_WRITE_REG(RTC->SHIFTR, ShiftSecond | Fraction);
}

/**
  * @}
  */

