MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/** @defgroup RTC_LL_EF_Date Date
  * @{
  */

/**
  * @brief  Set Year in BCD format.
  * @rmtoll
  *  RTC_DR           YT            LL_RTC_DATE_SetYear \n
  *  RTC_DR           YU            LL_RTC_DATE_SetYear
  * @param  Year Value between Min_Data=0x00 and Max_Data=0x99
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Year from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_DATE_SetYear(uint32_t Year)
{
  STM32_MODIFY_REG(RTC->DR, (RTC_DR_YT | RTC_DR_YU),
                   (((Year & 0xF0U) << (RTC_DR_YT_Pos - 4U)) | ((Year & 0x0FU) << RTC_DR_YU_Pos)));
}

/**
  * @brief  Get Year in BCD format.
  * @rmtoll
  *  RTC_DR           YT            LL_RTC_DATE_GetYear \n
  *  RTC_DR           YU            LL_RTC_DATE_GetYear
  * @retval Value between Min_Data=0x00 and Max_Data=0x99
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Year from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_DATE_GetYear(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->DR, (RTC_DR_YT | RTC_DR_YU))) >> RTC_DR_YU_Pos);
}

/**
  * @brief  Set weekday.
  * @rmtoll
  *  RTC_DR           WDU           LL_RTC_DATE_SetWeekDay
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE void LL_RTC_DATE_SetWeekDay(uint32_t WeekDay)
{
  STM32_MODIFY_REG(RTC->DR, RTC_DR_WDU, WeekDay << RTC_DR_WDU_Pos);
}

/**
  * @brief  Get weekday.
  * @rmtoll
  *  RTC_DR           WDU           LL_RTC_DATE_GetWeekDay
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  */
__STATIC_INLINE uint32_t LL_RTC_DATE_GetWeekDay(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->DR, RTC_DR_WDU) >> RTC_DR_WDU_Pos);
}

/**
  * @brief  Set Month in BCD format.
  * @rmtoll
  *  RTC_DR           MT            LL_RTC_DATE_SetMonth \n
  *  RTC_DR           MU            LL_RTC_DATE_SetMonth
  * @param  Month This parameter can be one of the following values:
  *         @arg @ref LL_RTC_MONTH_JANUARY
  *         @arg @ref LL_RTC_MONTH_FEBRUARY
  *         @arg @ref LL_RTC_MONTH_MARCH
  *         @arg @ref LL_RTC_MONTH_APRIL
  *         @arg @ref LL_RTC_MONTH_MAY
  *         @arg @ref LL_RTC_MONTH_JUNE
  *         @arg @ref LL_RTC_MONTH_JULY
  *         @arg @ref LL_RTC_MONTH_AUGUST
  *         @arg @ref LL_RTC_MONTH_SEPTEMBER
  *         @arg @ref LL_RTC_MONTH_OCTOBER
  *         @arg @ref LL_RTC_MONTH_NOVEMBER
  *         @arg @ref LL_RTC_MONTH_DECEMBER
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Month from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_DATE_SetMonth(uint32_t Month)
{
  STM32_MODIFY_REG(RTC->DR, (RTC_DR_MT | RTC_DR_MU),
                   (((Month & 0xF0U) << (RTC_DR_MT_Pos - 4U)) | ((Month & 0x0FU) << RTC_DR_MU_Pos)));
}

/**
  * @brief  Get Month in BCD format.
  * @rmtoll
  *  RTC_DR           MT            LL_RTC_DATE_GetMonth \n
  *  RTC_DR           MU            LL_RTC_DATE_GetMonth
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_MONTH_JANUARY
  *         @arg @ref LL_RTC_MONTH_FEBRUARY
  *         @arg @ref LL_RTC_MONTH_MARCH
  *         @arg @ref LL_RTC_MONTH_APRIL
  *         @arg @ref LL_RTC_MONTH_MAY
  *         @arg @ref LL_RTC_MONTH_JUNE
  *         @arg @ref LL_RTC_MONTH_JULY
  *         @arg @ref LL_RTC_MONTH_AUGUST
  *         @arg @ref LL_RTC_MONTH_SEPTEMBER
  *         @arg @ref LL_RTC_MONTH_OCTOBER
  *         @arg @ref LL_RTC_MONTH_NOVEMBER
  *         @arg @ref LL_RTC_MONTH_DECEMBER
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Month from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_DATE_GetMonth(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->DR, (RTC_DR_MT | RTC_DR_MU))) >> RTC_DR_MU_Pos);
}

/**
  * @brief  Set Day in BCD format.
  * @rmtoll
  *  RTC_DR           DT            LL_RTC_DATE_SetDay \n
  *  RTC_DR           DU            LL_RTC_DATE_SetDay
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Day from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_DATE_SetDay(uint32_t Day)
{
  STM32_MODIFY_REG(RTC->DR, (RTC_DR_DT | RTC_DR_DU),
                   (((Day & 0xF0U) << (RTC_DR_DT_Pos - 4U)) | ((Day & 0x0FU) << RTC_DR_DU_Pos)));
}

/**
  * @brief  Get Day in BCD format.
  * @rmtoll
  *  RTC_DR           DT            LL_RTC_DATE_GetDay \n
  *  RTC_DR           DU            LL_RTC_DATE_GetDay
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Day from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_DATE_GetDay(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->DR, (RTC_DR_DT | RTC_DR_DU))) >> RTC_DR_DU_Pos);
}

/**
  * @brief  Set date (WeekDay, Day, Month and Year) in BCD format.
  * @rmtoll
  *  RTC_DR           WDU           LL_RTC_DATE_Config \n
  *  RTC_DR           MT            LL_RTC_DATE_Config \n
  *  RTC_DR           MU            LL_RTC_DATE_Config \n
  *  RTC_DR           DT            LL_RTC_DATE_Config \n
  *  RTC_DR           DU            LL_RTC_DATE_Config \n
  *  RTC_DR           YT            LL_RTC_DATE_Config \n
  *  RTC_DR           YU            LL_RTC_DATE_Config
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @param  Month This parameter can be one of the following values:
  *         @arg @ref LL_RTC_MONTH_JANUARY
  *         @arg @ref LL_RTC_MONTH_FEBRUARY
  *         @arg @ref LL_RTC_MONTH_MARCH
  *         @arg @ref LL_RTC_MONTH_APRIL
  *         @arg @ref LL_RTC_MONTH_MAY
  *         @arg @ref LL_RTC_MONTH_JUNE
  *         @arg @ref LL_RTC_MONTH_JULY
  *         @arg @ref LL_RTC_MONTH_AUGUST
  *         @arg @ref LL_RTC_MONTH_SEPTEMBER
  *         @arg @ref LL_RTC_MONTH_OCTOBER
  *         @arg @ref LL_RTC_MONTH_NOVEMBER
  *         @arg @ref LL_RTC_MONTH_DECEMBER
  * @param  Year Value between Min_Data=0x00 and Max_Data=0x99
  */
__STATIC_INLINE void LL_RTC_DATE_Config(uint32_t WeekDay, uint32_t Day, uint32_t Month,
                                        uint32_t Year)
{
  uint32_t temp;

  temp = ((WeekDay & 0x0FU)  << RTC_DR_WDU_Pos)                                           | \
         (((Year & 0xF0U) << (RTC_DR_YT_Pos - 4U)) | ((Year & 0x0FU) << RTC_DR_YU_Pos))   | \
         (((Month & 0xF0U) << (RTC_DR_MT_Pos - 4U)) | ((Month & 0x0FU) << RTC_DR_MU_Pos)) | \
         (((Day & 0xF0U) << (RTC_DR_DT_Pos - 4U)) | ((Day & 0x0FU) << RTC_DR_DU_Pos));

  STM32_WRITE_REG(RTC->DR, temp);
}

/**
  * @brief  Get date (WeekDay, Day, Month and Year) in BCD format.
  * @rmtoll
  *  RTC_DR           WDU           LL_RTC_DATE_Get \n
  *  RTC_DR           MT            LL_RTC_DATE_Get \n
  *  RTC_DR           MU            LL_RTC_DATE_Get \n
  *  RTC_DR           DT            LL_RTC_DATE_Get \n
  *  RTC_DR           DU            LL_RTC_DATE_Get \n
  *  RTC_DR           YT            LL_RTC_DATE_Get \n
  *  RTC_DR           YU            LL_RTC_DATE_Get
  * @retval Combination of WeekDay, Day, Month and Year (Format: 0xWWDDMMYY)
  * @note   if RTC shadow registers are not bypassed (BYPSHAD=0), need to check if RSF flag is set
  *         before reading this bit
  * @note   helper macros LL_RTC_GET_WEEKDAY, LL_RTC_GET_YEAR, LL_RTC_GET_MONTH,
  *         and LL_RTC_GET_DAY are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_DATE_Get(void)
{
  uint32_t temp;

  temp = STM32_READ_BIT(RTC->DR, (RTC_DR_WDU | RTC_DR_MT | RTC_DR_MU | RTC_DR_DT | RTC_DR_DU | RTC_DR_YT | RTC_DR_YU));
  return (uint32_t)((((temp & RTC_DR_WDU) >> RTC_DR_WDU_Pos) << RTC_OFFSET_WEEKDAY) | \
                    (((((temp & RTC_DR_DT) >> RTC_DR_DT_Pos) << 4U) | ((temp & RTC_DR_DU) >> RTC_DR_DU_Pos)) \
                     << RTC_OFFSET_DAY)   | (((((temp & RTC_DR_MT) >> RTC_DR_MT_Pos) << 4U) | \
                                              ((temp & RTC_DR_MU) >> RTC_DR_MU_Pos)) << RTC_OFFSET_MONTH) | \
                    ((((temp & RTC_DR_YT) >> RTC_DR_YT_Pos) << 4U) | ((temp & RTC_DR_YU) >> RTC_DR_YU_Pos)));
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_ALARM ALARMA ALARMB
  * @{
  */

/**
  * @brief  Set alarm A or B Binary mode auto clear.
  * @rmtoll
  *  RTC_ALRMBSSR    SSCLR        LL_RTC_ALM_SetBinAutoClr \n
  *  RTC_ALRMASSR    SSCLR        LL_RTC_ALM_SetBinAutoClr
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @param  BinaryAutoClr This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_YES
  * @note   This register can be written only when ALRAE or ALRBE is reset in RTC_CR register,
  *         or in initialization mode
  * @note   SSCLR must be kept to 0 when BCD or mixed mode is used (BIN = 00, 10 or 11).
  */
__STATIC_INLINE void LL_RTC_ALM_SetBinAutoClr(uint32_t Alarm, uint32_t BinaryAutoClr)
{
  STM32_MODIFY_REG(*(&(RTC->ALRMASSR) + (RTC_ALRBSSR_ALRASSR_OFFSET * Alarm)), RTC_ALRMASSR_SSCLR, BinaryAutoClr);
}

/**
  * @brief  Get alarm A or B Binary mode auto clear.
  * @rmtoll
  *  RTC_ALRMBSSR    SSCLR        LL_RTC_ALM_GetBinAutoClr \n
  *  RTC_ALRMASSR    SSCLR        LL_RTC_ALM_GetBinAutoClr
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_YES
  */
__STATIC_INLINE uint32_t LL_RTC_ALM_GetBinAutoClr(const uint32_t Alarm)
{
  return (uint32_t)(STM32_READ_BIT(*(&(RTC->ALRMASSR) + (RTC_ALRBSSR_ALRASSR_OFFSET * Alarm)), \
                                   RTC_ALRMASSR_SSCLR));
}

/**
  * @brief  Set alarm A or B flag automatic clear.
  * @rmtoll
  *  RTC_CR   ALRBFCLR        LL_RTC_ALM_SetFlagAutoClr \n
  *  RTC_CR   ALRAFCLR        LL_RTC_ALM_SetFlagAutoClr
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @param  AutoClr This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALM_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALM_AUTOCLR_YES
  * @note   This register can be written only when ALRAE or ALRBE is reset in RTC_CR register,
  *         or in initialization mode
  */
__STATIC_INLINE void LL_RTC_ALM_SetFlagAutoClr(uint32_t Alarm, uint32_t AutoClr)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_ALRAFCLR << Alarm, AutoClr << Alarm);
}

/**
  * @brief  Get alarm A or B flag automatic clear.
  * @rmtoll
  *  RTC_CR   ALRBFCLR        LL_RTC_ALM_GetFlagAutoClr \n
  *  RTC_CR   ALRAFCLR        LL_RTC_ALM_GetFlagAutoClr
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALM_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALM_AUTOCLR_YES
  */
__STATIC_INLINE uint32_t LL_RTC_ALM_GetFlagAutoClr(const uint32_t Alarm)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, (RTC_CR_ALRAFCLR << Alarm)) >> Alarm);
}

/**
  * @brief  Set alarm A or B Time (hour, minute and second) in BCD format, time format,
  *         Day (weekday or day), weekday or day selection and masks.
  * @rmtoll
  *  RTC_ALRMBR       PM            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       HT            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       HU            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       MNT           LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       MNU           LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       ST            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       SU            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       MSK4          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       MSK3          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       MSK2          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       MSK1          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       WDSEL         LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       DT            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMBR       DU            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       PM            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       HT            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       HU            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       MNT           LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       MNU           LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       ST            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       SU            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       MSK4          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       MSK3          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       MSK2          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       MSK1          LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       WDSEL         LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       DT            LL_RTC_ALM_SetConfigDateTime \n
  *  RTC_ALRMAR       DU            LL_RTC_ALM_SetConfigDateTime
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @param  Mask This parameter can be a combination of the following values:
  *         @arg @ref LL_RTC_ALMA_MASK_NONE
  *         @arg @ref LL_RTC_ALMA_MASK_DATEWEEKDAY
  *         @arg @ref LL_RTC_ALMA_MASK_HOURS
  *         @arg @ref LL_RTC_ALMA_MASK_MINUTES
  *         @arg @ref LL_RTC_ALMA_MASK_SECONDS
  *         @arg @ref LL_RTC_ALMA_MASK_ALL
  * @param  DayWeekDaySelection This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_DATEWEEKDAYSEL_DATE
  *         @arg @ref LL_RTC_ALMA_DATEWEEKDAYSEL_WEEKDAY
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31 if the weekday is not selected
  *                   if weekday is selected, can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  * @param  Format12_24 This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_PM
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @note   This register can be written only when ALRAE or ALRBE is reset in RTC_CR register,
  *         or in initialization mode
  */
__STATIC_INLINE void LL_RTC_ALM_SetConfigDateTime(uint32_t Alarm,
                                                  uint32_t Mask, uint32_t DayWeekDaySelection,
                                                  uint32_t Day, uint32_t Format12_24,
                                                  uint32_t Hours, uint32_t Minutes,
                                                  uint32_t Seconds)
{
  STM32_WRITE_REG(*(&(RTC->ALRMAR) + (RTC_ALRBR_ALRAR_OFFSET * Alarm)), (Seconds << RTC_ALRMAR_SU_Pos)
                  | (Minutes << RTC_ALRMAR_MNU_Pos) | (Hours << RTC_ALRMAR_HU_Pos) | (Format12_24)
                  | (DayWeekDaySelection) | (Day << RTC_ALRMAR_DU_Pos) | Mask);
}

/**
  * @brief  Get alarm A or B Time (hour, minute and second) in BCD format, time format,
  *         Day (weekday or day), weekday or day selection and masks.
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @retval Content of the RTC_ALRMAR or RTC_ALRMBR register
  */
__STATIC_INLINE uint32_t LL_RTC_ALM_GetConfigDateTime(const uint32_t Alarm)
{
  return STM32_READ_REG(*(&(RTC->ALRMAR) + (RTC_ALRBR_ALRAR_OFFSET * Alarm)));
}

/**
  * @brief  Set alarm A or B sub seconds mask and value.
  * @rmtoll
  *  RTC_ALRMBSSR     MASKSS        LL_RTC_ALM_SetConfigSubSecond \n
  *  RTC_ALRMBSSR     SS            LL_RTC_ALM_SetConfigSubSecond \n
  *  RTC_ALRMASSR     MASKSS        LL_RTC_ALM_SetConfigSubSecond \n
  *  RTC_ALRMASSR     SS            LL_RTC_ALM_SetConfigSubSecond
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @param  Mask If binary mode is none, Value between Min_Data=0x0 and Max_Data=0xF
  *              else Value between Min_Data=0x0 and Max_Data=0x3F
  * @param  Subsecond Value between Min_Data=0x00 and Max_Data=0x7FFF
  * @note   This register can be written only when ALRAE or ALRBE is reset in RTC_CR register,
  *         or in initialization mode
  */
__STATIC_INLINE void LL_RTC_ALM_SetConfigSubSecond(uint32_t Alarm,
                                                   uint32_t Mask,  uint32_t Subsecond)
{
  STM32_MODIFY_REG(*(&(RTC->ALRMASSR) + (RTC_ALRBSSR_ALRASSR_OFFSET * Alarm)),
                   RTC_ALRMASSR_MASKSS | RTC_ALRMASSR_SS, (Mask << RTC_ALRMASSR_MASKSS_Pos)
                   | Subsecond);
}

/**
  * @brief  Get alarm A or B sub seconds mask and value.
  * @rmtoll
  *  RTC_ALRMASSR     MASKSS        LL_RTC_ALM_GetConfigSubSecond \n
  *  RTC_ALRMASSR     SS            LL_RTC_ALM_GetConfigSubSecond \n
  *  RTC_ALRMBSSR     MASKSS        LL_RTC_ALM_GetConfigSubSecond \n
  *  RTC_ALRMBSSR     SS            LL_RTC_ALM_GetConfigSubSecond
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @retval Mask If binary mode is none, Value between Min_Data=0x0 and Max_Data=0xF
  *              else Value between Min_Data=0x0 and Max_Data=0x3F
  *         Subsecond Value between Min_Data=0x00 and Max_Data=0x7FFF
  *         Result is given in the form 0x00MMSSSS
  */
__STATIC_INLINE uint32_t LL_RTC_ALM_GetConfigSubSecond(const uint32_t Alarm)
{
  uint32_t temp = STM32_READ_BIT(*(&(RTC->ALRMASSR) + (RTC_ALRBSSR_ALRASSR_OFFSET * Alarm)),
                                 RTC_ALRMASSR_MASKSS | RTC_ALRMASSR_SS);

