MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
  return ((((temp & RTC_ALRMASSR_MASKSS) >> RTC_ALRMASSR_MASKSS_Pos) << RTC_OFFSET_ALR_MASK_SUBS_SECONDS) | \
          ((temp & RTC_ALRMASSR_SS) >> RTC_ALRMASSR_SS_Pos));
}

/**
  * @brief  Start alarm A or B.
  * @rmtoll
  *  RTC_CR     ALRBIE        LL_RTC_ALM_Start \n
  *  RTC_CR     ALRBE         LL_RTC_ALM_Start \n
  *  RTC_CR     ALRAIE        LL_RTC_ALM_Start \n
  *  RTC_CR     ALRAE         LL_RTC_ALM_Start
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @param  Interruption This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_IT_DISABLE
  *         @arg @ref LL_RTC_ALMA_IT_ENABLE
  */
__STATIC_INLINE void LL_RTC_ALM_Start(uint32_t Alarm, uint32_t Interruption)
{
  STM32_MODIFY_REG(RTC->CR, (RTC_CR_ALRAIE << Alarm) |
                   (RTC_CR_ALRAE << Alarm),
                   (RTC_CR_ALRAE << Alarm) |
                   (Interruption << Alarm));
}

/**
  * @brief  Stop alarm A or B.
  * @rmtoll
  *  RTC_CR     ALRBIE        LL_RTC_ALM_Stop \n
  *  RTC_CR     ALRBE         LL_RTC_ALM_Stop \n
  *  RTC_CR     ALRAIE        LL_RTC_ALM_Stop \n
  *  RTC_CR     ALRAE         LL_RTC_ALM_Stop
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  */
__STATIC_INLINE void LL_RTC_ALM_Stop(uint32_t Alarm)
{
  STM32_MODIFY_REG(RTC->CR, (RTC_CR_ALRAIE << Alarm) | (RTC_CR_ALRAE << Alarm), 0UL);
}

/**
  * @brief  Is alarm A or B Enabled.
  * @rmtoll
  *  RTC_CR     ALRBIE        LL_RTC_ALM_IsStarted \n
  *  RTC_CR     ALRBE         LL_RTC_ALM_IsStarted \n
  *  RTC_CR     ALRAIE        LL_RTC_ALM_IsStarted \n
  *  RTC_CR     ALRAIE        LL_RTC_ALM_IsStarted
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_ALM_IsStarted(const uint32_t Alarm)
{
  return (((STM32_READ_REG(RTC->CR) & (RTC_CR_ALRAE << Alarm)) == 0U) ? 0UL : 1UL);
}

/**
  * @brief  Set alarm A or B Sub seconds value.
  * @rmtoll
  *  RTC_ALRABINR      SS            LL_RTC_ALM_SetBinarySubSecond \n
  *  RTC_ALRBBINR      SS            LL_RTC_ALM_SetBinarySubSecond
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @param  Subsecond If binary mode is none, Value between Min_Data=0x0 and Max_Data=0x7FFF
  *                   else Value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE void LL_RTC_ALM_SetBinarySubSecond(uint32_t Alarm, uint32_t Subsecond)
{
  STM32_WRITE_REG(*(&(RTC->ALRABINR) + (RTC_ALRBBINR_ALRABINR_OFFSET * Alarm)), Subsecond);
}

/**
  * @brief  Get alarm A or B Sub seconds value.
  * @rmtoll
  *  RTC_ALRABINR      SS            LL_RTC_ALM_GetBinarySubSecond \n
  *  RTC_ALRBBINR      SS            LL_RTC_ALM_GetBinarySubSecond
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @retval If binary mode is none, Value between Min_Data=0x0 and Max_Data=0x7FFF
  *         else Value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_RTC_ALM_GetBinarySubSecond(const uint32_t Alarm)
{
  return (uint32_t)(STM32_READ_REG(*(&(RTC->ALRABINR) + (RTC_ALRBBINR_ALRABINR_OFFSET * Alarm))));
}

/**
  * @brief  Set alarm A or B Sub seconds mask.
  * @rmtoll
  *  RTC_ALRMASSR     MASKSS        LL_RTC_ALM_SetSubSecondMask \n
  *  RTC_ALRMBSSR     MASKSS        LL_RTC_ALM_SetSubSecondMask
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @param  Mask If binary mode is none, Value between Min_Data=0x0 and Max_Data=0xF
  *              else Value between Min_Data=0x0 and Max_Data=0x3F
  * @note   This register can be written only when ALRAE or ALRBE is reset in RTC_CR register,
  *         or in initialization mode
  */
__STATIC_INLINE void LL_RTC_ALM_SetSubSecondMask(uint32_t Alarm, uint32_t Mask)
{
  STM32_MODIFY_REG(*(&(RTC->ALRMASSR) + (RTC_ALRBSSR_ALRASSR_OFFSET * Alarm)),
                   RTC_ALRMASSR_MASKSS, (Mask << RTC_ALRMASSR_MASKSS_Pos));
}

/**
  * @brief  Get alarm A or B sub seconds mask.
  * @rmtoll
  *  RTC_ALRMASSR     MASKSS        LL_RTC_ALM_GetSubSecondMask \n
  *  RTC_ALRMBSSR     MASKSS        LL_RTC_ALM_GetSubSecondMask
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  * @retval Mask If binary mode is none, Value between Min_Data=0x0 and Max_Data=0xF
  *              else Value between Min_Data=0x0 and Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_RTC_ALM_GetSubSecondMask(const uint32_t Alarm)
{
  uint32_t temp = STM32_READ_BIT(*(&(RTC->ALRMASSR) + (RTC_ALRBSSR_ALRASSR_OFFSET * Alarm)),
                                 RTC_ALRMASSR_MASKSS);

  return temp >> (RTC_ALRMASSR_MASKSS_Pos);
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_ALARMA ALARMA
  * @{
  */

/**
  * @brief  Enable alarm A.
  * @rmtoll
  *  RTC_CR           ALRAE         LL_RTC_ALMA_Enable
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_ALMA_Enable(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_ALRAE);
}

/**
  * @brief  Disable alarm A.
  * @rmtoll
  *  RTC_CR           ALRAE         LL_RTC_ALMA_Disable
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_ALMA_Disable(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_ALRAE);
}

/**
  * @brief  Specify the alarm A masks.
  * @rmtoll
  *  RTC_ALRMAR       MSK4          LL_RTC_ALMA_SetMask \n
  *  RTC_ALRMAR       MSK3          LL_RTC_ALMA_SetMask \n
  *  RTC_ALRMAR       MSK2          LL_RTC_ALMA_SetMask \n
  *  RTC_ALRMAR       MSK1          LL_RTC_ALMA_SetMask
  * @param  Mask This parameter can be a combination of the following values:
  *         @arg @ref LL_RTC_ALMA_MASK_NONE
  *         @arg @ref LL_RTC_ALMA_MASK_DATEWEEKDAY
  *         @arg @ref LL_RTC_ALMA_MASK_HOURS
  *         @arg @ref LL_RTC_ALMA_MASK_MINUTES
  *         @arg @ref LL_RTC_ALMA_MASK_SECONDS
  *         @arg @ref LL_RTC_ALMA_MASK_ALL
  */
__STATIC_INLINE void LL_RTC_ALMA_SetMask(uint32_t Mask)
{
  STM32_MODIFY_REG(RTC->ALRMAR, RTC_ALRMAR_MSK4 | RTC_ALRMAR_MSK3 | RTC_ALRMAR_MSK2 | RTC_ALRMAR_MSK1, Mask);
}

/**
  * @brief  Get the alarm A masks.
  * @rmtoll
  *  RTC_ALRMAR       MSK4          LL_RTC_ALMA_GetMask \n
  *  RTC_ALRMAR       MSK3          LL_RTC_ALMA_GetMask \n
  *  RTC_ALRMAR       MSK2          LL_RTC_ALMA_GetMask \n
  *  RTC_ALRMAR       MSK1          LL_RTC_ALMA_GetMask
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_RTC_ALMA_MASK_NONE
  *         @arg @ref LL_RTC_ALMA_MASK_DATEWEEKDAY
  *         @arg @ref LL_RTC_ALMA_MASK_HOURS
  *         @arg @ref LL_RTC_ALMA_MASK_MINUTES
  *         @arg @ref LL_RTC_ALMA_MASK_SECONDS
  *         @arg @ref LL_RTC_ALMA_MASK_ALL
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetMask(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMAR, RTC_ALRMAR_MSK4 | RTC_ALRMAR_MSK3 | RTC_ALRMAR_MSK2 | RTC_ALRMAR_MSK1));
}

/**
  * @brief  Enable alarm A weekday selection (DU[3:0] represents the weekday. DT[1:0] is ignored).
  * @rmtoll
  *  RTC_ALRMAR       WDSEL         LL_RTC_ALMA_EnableWeekday
  */
__STATIC_INLINE void LL_RTC_ALMA_EnableWeekday(void)
{
  STM32_SET_BIT(RTC->ALRMAR, RTC_ALRMAR_WDSEL);
}

/**
  * @brief  Disable alarm A weekday selection (DU[3:0] represents the date).
  * @rmtoll
  *  RTC_ALRMAR       WDSEL         LL_RTC_ALMA_DisableWeekday
  */
__STATIC_INLINE void LL_RTC_ALMA_DisableWeekday(void)
{
  STM32_CLEAR_BIT(RTC->ALRMAR, RTC_ALRMAR_WDSEL);
}

/**
  * @brief  Check whether alarm A weekday selection is enabled.
  * @rmtoll
  *  RTC_ALRMAR       WDSEL         LL_RTC_ALMA_IsEnabledWeekday
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_IsEnabledWeekday(void)
{
  return ((STM32_READ_BIT(RTC->ALRMAR, RTC_ALRMAR_WDSEL) == (RTC_ALRMAR_WDSEL)) ? 1UL : 0UL);
}

/**
  * @brief  Set alarm A Day in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       DT            LL_RTC_ALMA_SetDay \n
  *  RTC_ALRMAR       DU            LL_RTC_ALMA_SetDay
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Day from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMA_SetDay(uint32_t Day)
{
  STM32_MODIFY_REG(RTC->ALRMAR, (RTC_ALRMAR_DT | RTC_ALRMAR_DU),
                   (((Day & 0xF0U) << (RTC_ALRMAR_DT_Pos - 4U)) | ((Day & 0x0FU) << RTC_ALRMAR_DU_Pos)));
}

/**
  * @brief  Get alarm A Day in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       DT            LL_RTC_ALMA_GetDay \n
  *  RTC_ALRMAR       DU            LL_RTC_ALMA_GetDay
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Day from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetDay(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMAR, (RTC_ALRMAR_DT | RTC_ALRMAR_DU))) >> RTC_ALRMAR_DU_Pos);
}

/**
  * @brief  Set alarm A Weekday.
  * @rmtoll
  *  RTC_ALRMAR       DU            LL_RTC_ALMA_SetWeekDay
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  * @note   DU in weekday mode only if WDSEL is enabled
  */
__STATIC_INLINE void LL_RTC_ALMA_SetWeekDay(uint32_t WeekDay)
{
  STM32_MODIFY_REG(RTC->ALRMAR, RTC_ALRMAR_DU, WeekDay << RTC_ALRMAR_DU_Pos);
}

/**
  * @brief  Get alarm A Weekday.
  * @rmtoll
  *  RTC_ALRMAR       DU            LL_RTC_ALMA_GetWeekDay
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  * @note   DU in weekday mode only if WDSEL is enabled
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetWeekDay(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMAR, RTC_ALRMAR_DU) >> RTC_ALRMAR_DU_Pos);
}

/**
  * @brief  Set alarm A time format (AM/24-hour or PM notation).
  * @rmtoll
  *  RTC_ALRMAR       PM            LL_RTC_ALMA_SetTimeFormat
  * @param  TimeFormat This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_PM
  */
__STATIC_INLINE void LL_RTC_ALMA_SetTimeFormat(uint32_t TimeFormat)
{
  STM32_MODIFY_REG(RTC->ALRMAR, RTC_ALRMAR_PM, TimeFormat);
}

/**
  * @brief  Get alarm A time format (AM or PM notation).
  * @rmtoll
  *  RTC_ALRMAR       PM            LL_RTC_ALMA_GetTimeFormat
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_PM
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetTimeFormat(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMAR, RTC_ALRMAR_PM));
}

/**
  * @brief  Set alarm A Hours in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       HT            LL_RTC_ALMA_SetHour \n
  *  RTC_ALRMAR       HU            LL_RTC_ALMA_SetHour
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Hours from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMA_SetHour(uint32_t Hours)
{
  STM32_MODIFY_REG(RTC->ALRMAR, (RTC_ALRMAR_HT | RTC_ALRMAR_HU),
                   (((Hours & 0xF0U) << (RTC_ALRMAR_HT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_ALRMAR_HU_Pos)));
}

/**
  * @brief  Get alarm A Hours in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       HT            LL_RTC_ALMA_GetHour \n
  *  RTC_ALRMAR       HU            LL_RTC_ALMA_GetHour
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Hours from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetHour(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMAR, (RTC_ALRMAR_HT | RTC_ALRMAR_HU))) >> RTC_ALRMAR_HU_Pos);
}

/**
  * @brief  Set alarm A Minutes in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       MNT           LL_RTC_ALMA_SetMinute \n
  *  RTC_ALRMAR       MNU           LL_RTC_ALMA_SetMinute
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Minutes from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMA_SetMinute(uint32_t Minutes)
{
  STM32_MODIFY_REG(RTC->ALRMAR, (RTC_ALRMAR_MNT | RTC_ALRMAR_MNU),
                   (((Minutes & 0xF0U) << (RTC_ALRMAR_MNT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMAR_MNU_Pos)));
}

/**
  * @brief  Get alarm A Minutes in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       MNT           LL_RTC_ALMA_GetMinute \n
  *  RTC_ALRMAR       MNU           LL_RTC_ALMA_GetMinute
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Minutes from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetMinute(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMAR, (RTC_ALRMAR_MNT | RTC_ALRMAR_MNU))) >> RTC_ALRMAR_MNU_Pos);
}

/**
  * @brief  Set alarm A Seconds in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       ST            LL_RTC_ALMA_SetSecond \n
  *  RTC_ALRMAR       SU            LL_RTC_ALMA_SetSecond
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Seconds from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMA_SetSecond(uint32_t Seconds)
{
  STM32_MODIFY_REG(RTC->ALRMAR, (RTC_ALRMAR_ST | RTC_ALRMAR_SU),
                   (((Seconds & 0xF0U) << (RTC_ALRMAR_ST_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMAR_SU_Pos)));
}

/**
  * @brief  Get alarm A Seconds in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       ST            LL_RTC_ALMA_GetSecond \n
  *  RTC_ALRMAR       SU            LL_RTC_ALMA_GetSecond
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Seconds from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetSecond(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMAR, (RTC_ALRMAR_ST | RTC_ALRMAR_SU))) >> RTC_ALRMAR_SU_Pos);
}

/**
  * @brief  Set alarm A Time (hour, minute and second) in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       PM            LL_RTC_ALMA_ConfigTime \n
  *  RTC_ALRMAR       HT            LL_RTC_ALMA_ConfigTime \n
  *  RTC_ALRMAR       HU            LL_RTC_ALMA_ConfigTime \n
  *  RTC_ALRMAR       MNT           LL_RTC_ALMA_ConfigTime \n
  *  RTC_ALRMAR       MNU           LL_RTC_ALMA_ConfigTime \n
  *  RTC_ALRMAR       ST            LL_RTC_ALMA_ConfigTime \n
  *  RTC_ALRMAR       SU            LL_RTC_ALMA_ConfigTime
  * @param  Format12_24 This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_ALMA_TIME_FORMAT_PM
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE void LL_RTC_ALMA_ConfigTime(uint32_t Format12_24, uint32_t Hours, uint32_t Minutes,
                                            uint32_t Seconds)
{
  uint32_t temp;

  temp = Format12_24 | (((Hours & 0xF0U) << (RTC_ALRMAR_HT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_ALRMAR_HU_Pos))    | \
         (((Minutes & 0xF0U) << (RTC_ALRMAR_MNT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMAR_MNU_Pos)) | \
         (((Seconds & 0xF0U) << (RTC_ALRMAR_ST_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMAR_SU_Pos));

  STM32_MODIFY_REG(RTC->ALRMAR, RTC_ALRMAR_PM | RTC_ALRMAR_HT | RTC_ALRMAR_HU | RTC_ALRMAR_MNT | RTC_ALRMAR_MNU | \
                   RTC_ALRMAR_ST | RTC_ALRMAR_SU, temp);
}

/**
  * @brief  Get alarm A Time (hour, minute and second) in BCD format.
  * @rmtoll
  *  RTC_ALRMAR       HT            LL_RTC_ALMA_GetTime \n
  *  RTC_ALRMAR       HU            LL_RTC_ALMA_GetTime \n
  *  RTC_ALRMAR       MNT           LL_RTC_ALMA_GetTime \n
  *  RTC_ALRMAR       MNU           LL_RTC_ALMA_GetTime \n
  *  RTC_ALRMAR       ST            LL_RTC_ALMA_GetTime \n
  *  RTC_ALRMAR       SU            LL_RTC_ALMA_GetTime
  * @retval Combination of hours, minutes and seconds
  * @note   helper macros LL_RTC_GET_HOUR, LL_RTC_GET_MINUTE and LL_RTC_GET_SECOND
  *         are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetTime(void)
{
  return (uint32_t)((LL_RTC_ALMA_GetHour() << RTC_OFFSET_HOUR) | (LL_RTC_ALMA_GetMinute() << \
                                                                  RTC_OFFSET_MINUTE) | LL_RTC_ALMA_GetSecond());
}

/**
  * @brief  Set alarm A Mask the most-significant bits starting at this bit.
  * @rmtoll
  *  RTC_ALRMASSR     MASKSS        LL_RTC_ALMA_SetSubSecondMask
  * @param  Mask If binary mode is none, Value between Min_Data=0x0 and Max_Data=0xF
  *              else Value between Min_Data=0x0 and Max_Data=0x3F
  * @note   This register can be written only when ALRAE is reset in RTC_CR register,
  *         or in initialization mode
  */
__STATIC_INLINE void LL_RTC_ALMA_SetSubSecondMask(uint32_t Mask)
{
  STM32_MODIFY_REG(RTC->ALRMASSR, RTC_ALRMASSR_MASKSS, Mask << RTC_ALRMASSR_MASKSS_Pos);
}

/**
  * @brief  Get alarm A Mask the most-significant bits starting at this bit.
  * @rmtoll
  *  RTC_ALRMASSR     MASKSS        LL_RTC_ALMA_GetSubSecondMask
  * @retval If binary mode is none, Value between Min_Data=0x0 and Max_Data=0xF
  *         else Value between Min_Data=0x0 and Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetSubSecondMask(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMASSR, RTC_ALRMASSR_MASKSS) >> RTC_ALRMASSR_MASKSS_Pos);
}

/**
  * @brief  Set alarm A Binary mode auto clear.
  * @rmtoll
  *  RTC_ALRMASSR    SSCLR        LL_RTC_ALMA_SetBinAutoClr
  * @param  BinaryAutoClr This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_YES
  * @note   This register can be written only when ALRAE is reset in RTC_CR register,
  *         or in initialization mode
  * @note   SSCLR must be kept to 0 when BCD or mixed mode is used (BIN = 00, 10 or 11).
  */
__STATIC_INLINE void LL_RTC_ALMA_SetBinAutoClr(uint32_t BinaryAutoClr)
{
  STM32_MODIFY_REG(RTC->ALRMASSR, RTC_ALRMASSR_SSCLR, BinaryAutoClr);
}

/**
  * @brief  Get alarm A Binary mode auto clear.
  * @rmtoll
  *  RTC_ALRMASSR     SSCLR        LL_RTC_ALMA_GetBinAutoClr
  * @retval It can be one of the following values:
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_YES
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetBinAutoClr(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMASSR, RTC_ALRMASSR_SSCLR));
}

/**
  * @brief  Set alarm A Sub seconds value.
  * @rmtoll
  *  RTC_ALRMASSR     SS            LL_RTC_ALMA_SetSubSecond
  * @param  Subsecond If binary mode is none, Value between Min_Data=0x0 and Max_Data=0x7FFF
  *                   else Value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE void LL_RTC_ALMA_SetSubSecond(uint32_t Subsecond)
{
  STM32_MODIFY_REG(RTC->ALRMASSR, RTC_ALRMASSR_SS, Subsecond);
}

/**
  * @brief  Get alarm A Sub seconds value.
  * @rmtoll
  *  RTC_ALRMASSR     SS            LL_RTC_ALMA_GetSubSecond
  * @retval If binary mode is none, Value between Min_Data=0x0 and Max_Data=0x7FFF
  *         else Value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_RTC_ALMA_GetSubSecond(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMASSR, RTC_ALRMASSR_SS));
}

/**
  * @}
  */

