MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/** @defgroup RTC_LL_EF_ALARMB ALARMB
  * @{
  */

/**
  * @brief  Enable alarm B.
  * @rmtoll
  *  RTC_CR           ALRBE         LL_RTC_ALMB_Enable
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_ALMB_Enable(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_ALRBE);
}

/**
  * @brief  Disable alarm B.
  * @rmtoll
  *  RTC_CR           ALRBE         LL_RTC_ALMB_Disable
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function must preferably be called before
  */
__STATIC_INLINE void LL_RTC_ALMB_Disable(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_ALRBE);
}

/**
  * @brief  Specify the alarm B masks.
  * @rmtoll
  *  RTC_ALRMBR       MSK4          LL_RTC_ALMB_SetMask \n
  *  RTC_ALRMBR       MSK3          LL_RTC_ALMB_SetMask \n
  *  RTC_ALRMBR       MSK2          LL_RTC_ALMB_SetMask \n
  *  RTC_ALRMBR       MSK1          LL_RTC_ALMB_SetMask
  * @param  Mask This parameter can be a combination of the following values:
  *         @arg @ref LL_RTC_ALMB_MASK_NONE
  *         @arg @ref LL_RTC_ALMB_MASK_DATEWEEKDAY
  *         @arg @ref LL_RTC_ALMB_MASK_HOURS
  *         @arg @ref LL_RTC_ALMB_MASK_MINUTES
  *         @arg @ref LL_RTC_ALMB_MASK_SECONDS
  *         @arg @ref LL_RTC_ALMB_MASK_ALL
  */
__STATIC_INLINE void LL_RTC_ALMB_SetMask(uint32_t Mask)
{
  STM32_MODIFY_REG(RTC->ALRMBR, RTC_ALRMBR_MSK4 | RTC_ALRMBR_MSK3 | RTC_ALRMBR_MSK2 | RTC_ALRMBR_MSK1, Mask);
}

/**
  * @brief  Get the alarm B masks.
  * @rmtoll
  *  RTC_ALRMBR       MSK4          LL_RTC_ALMB_GetMask \n
  *  RTC_ALRMBR       MSK3          LL_RTC_ALMB_GetMask \n
  *  RTC_ALRMBR       MSK2          LL_RTC_ALMB_GetMask \n
  *  RTC_ALRMBR       MSK1          LL_RTC_ALMB_GetMask
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_RTC_ALMB_MASK_NONE
  *         @arg @ref LL_RTC_ALMB_MASK_DATEWEEKDAY
  *         @arg @ref LL_RTC_ALMB_MASK_HOURS
  *         @arg @ref LL_RTC_ALMB_MASK_MINUTES
  *         @arg @ref LL_RTC_ALMB_MASK_SECONDS
  *         @arg @ref LL_RTC_ALMB_MASK_ALL
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetMask(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMBR, RTC_ALRMBR_MSK4 | RTC_ALRMBR_MSK3 | RTC_ALRMBR_MSK2 | RTC_ALRMBR_MSK1));
}

/**
  * @brief  Enable alarm B weekday selection (DU[3:0] represents the weekday. DT[1:0] is ignored).
  * @rmtoll
  *  RTC_ALRMBR       WDSEL         LL_RTC_ALMB_EnableWeekday
  */
__STATIC_INLINE void LL_RTC_ALMB_EnableWeekday(void)
{
  STM32_SET_BIT(RTC->ALRMBR, RTC_ALRMBR_WDSEL);
}

/**
  * @brief  Disable alarm B weekday selection (DU[3:0] represents the date).
  * @rmtoll
  *  RTC_ALRMBR       WDSEL         LL_RTC_ALMB_DisableWeekday
  */
__STATIC_INLINE void LL_RTC_ALMB_DisableWeekday(void)
{
  STM32_CLEAR_BIT(RTC->ALRMBR, RTC_ALRMBR_WDSEL);
}

/**
  * @brief  Check whether alarm B weekday selection is enabled.
  * @rmtoll
  *  RTC_ALRMBR       WDSEL         LL_RTC_ALMB_IsEnabledWeekday
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_IsEnabledWeekday(void)
{
  return ((STM32_READ_BIT(RTC->ALRMBR, RTC_ALRMBR_WDSEL) == (RTC_ALRMBR_WDSEL)) ? 1UL : 0UL);
}


/**
  * @brief  Set alarm B Day in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       DT            LL_RTC_ALMB_SetDay \n
  *  RTC_ALRMBR       DU            LL_RTC_ALMB_SetDay
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @note   helper macro LL_RTC_CONVERT_BIN2BCD is available to convert Day from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMB_SetDay(uint32_t Day)
{
  STM32_MODIFY_REG(RTC->ALRMBR, (RTC_ALRMBR_DT | RTC_ALRMBR_DU),
                   (((Day & 0xF0U) << (RTC_ALRMBR_DT_Pos - 4U)) | ((Day & 0x0FU) << RTC_ALRMBR_DU_Pos)));
}

/**
  * @brief  Get alarm B Day in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       DT            LL_RTC_ALMB_GetDay \n
  *  RTC_ALRMBR       DU            LL_RTC_ALMB_GetDay
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  * @note   helper macro LL_RTC_CONVERT_BCD2BIN is available to convert Day from BCD to Binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetDay(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMBR, (RTC_ALRMBR_DT | RTC_ALRMBR_DU))) >> RTC_ALRMBR_DU_Pos);
}

/**
  * @brief  Set alarm B Weekday.
  * @rmtoll
  *  RTC_ALRMBR       DU            LL_RTC_ALMB_SetWeekDay
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE void LL_RTC_ALMB_SetWeekDay(uint32_t WeekDay)
{
  STM32_MODIFY_REG(RTC->ALRMBR, RTC_ALRMBR_DU, WeekDay << RTC_ALRMBR_DU_Pos);
}

/**
  * @brief  Get alarm B Weekday.
  * @rmtoll
  *  RTC_ALRMBR       DU            LL_RTC_ALMB_GetWeekDay
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetWeekDay(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMBR, RTC_ALRMBR_DU) >> RTC_ALRMBR_DU_Pos);
}

/**
  * @brief  Set alarm B time format (AM/24-hour or PM notation).
  * @rmtoll
  *  RTC_ALRMBR       PM            LL_RTC_ALMB_SetTimeFormat
  * @param  TimeFormat This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMB_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_ALMB_TIME_FORMAT_PM
  */
__STATIC_INLINE void LL_RTC_ALMB_SetTimeFormat(uint32_t TimeFormat)
{
  STM32_MODIFY_REG(RTC->ALRMBR, RTC_ALRMBR_PM, TimeFormat);
}

/**
  * @brief  Get alarm B time format (AM/24-hour or PM notation).
  * @rmtoll
  *  RTC_ALRMBR       PM            LL_RTC_ALMB_GetTimeFormat
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_ALMB_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_ALMB_TIME_FORMAT_PM
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetTimeFormat(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMBR, RTC_ALRMBR_PM));
}

/**
  * @brief  Set alarm B hours in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       HT            LL_RTC_ALMB_SetHour \n
  *  RTC_ALRMBR       HU            LL_RTC_ALMB_SetHour
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @note   Helper macro LL_RTC_CONVERT_BIN2BCD is available to convert hours from
  *         binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMB_SetHour(uint32_t Hours)
{
  STM32_MODIFY_REG(RTC->ALRMBR, (RTC_ALRMBR_HT | RTC_ALRMBR_HU),
                   (((Hours & 0xF0U) << (RTC_ALRMBR_HT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_ALRMBR_HU_Pos)));
}

/**
  * @brief  Get alarm B hours in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       HT            LL_RTC_ALMB_GetHour \n
  *  RTC_ALRMBR       HU            LL_RTC_ALMB_GetHour
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert hours from
  *         BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetHour(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMBR, (RTC_ALRMBR_HT | RTC_ALRMBR_HU))) >> RTC_ALRMBR_HU_Pos);
}

/**
  * @brief  Set alarm B minutes in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       MNT           LL_RTC_ALMB_SetMinute \n
  *  RTC_ALRMBR       MNU           LL_RTC_ALMB_SetMinute
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Helper macro LL_RTC_CONVERT_BIN2BCD is available to convert minutes
  *         from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMB_SetMinute(uint32_t Minutes)
{
  STM32_MODIFY_REG(RTC->ALRMBR, (RTC_ALRMBR_MNT | RTC_ALRMBR_MNU),
                   (((Minutes & 0xF0U) << (RTC_ALRMBR_MNT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMBR_MNU_Pos)));
}

/**
  * @brief  Get alarm B minutes in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       MNT           LL_RTC_ALMB_GetMinute \n
  *  RTC_ALRMBR       MNU           LL_RTC_ALMB_GetMinute
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert minutes
  *         from BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetMinute(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMBR, (RTC_ALRMBR_MNT | RTC_ALRMBR_MNU))) >> RTC_ALRMBR_MNU_Pos);
}

/**
  * @brief  Set alarm B seconds in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       ST            LL_RTC_ALMB_SetSecond \n
  *  RTC_ALRMBR       SU            LL_RTC_ALMB_SetSecond
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Helper macro LL_RTC_CONVERT_BIN2BCD is available to convert seconds
  *         from binary to BCD format
  */
__STATIC_INLINE void LL_RTC_ALMB_SetSecond(uint32_t Seconds)
{
  STM32_MODIFY_REG(RTC->ALRMBR, (RTC_ALRMBR_ST | RTC_ALRMBR_SU),
                   (((Seconds & 0xF0U) << (RTC_ALRMBR_ST_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMBR_SU_Pos)));
}

/**
  * @brief  Get alarm B seconds in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       ST            LL_RTC_ALMB_GetSecond \n
  *  RTC_ALRMBR       SU            LL_RTC_ALMB_GetSecond
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert seconds
  *         from BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetSecond(void)
{
  return (uint32_t)((STM32_READ_BIT(RTC->ALRMBR, (RTC_ALRMBR_ST | RTC_ALRMBR_SU))) >> RTC_ALRMBR_SU_Pos);
}

/**
  * @brief  Set alarm B time (hour, minute and second) in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       PM            LL_RTC_ALMB_ConfigTime \n
  *  RTC_ALRMBR       HT            LL_RTC_ALMB_ConfigTime \n
  *  RTC_ALRMBR       HU            LL_RTC_ALMB_ConfigTime \n
  *  RTC_ALRMBR       MNT           LL_RTC_ALMB_ConfigTime \n
  *  RTC_ALRMBR       MNU           LL_RTC_ALMB_ConfigTime \n
  *  RTC_ALRMBR       ST            LL_RTC_ALMB_ConfigTime \n
  *  RTC_ALRMBR       SU            LL_RTC_ALMB_ConfigTime
  * @param  Format12_24 This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMB_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_ALMB_TIME_FORMAT_PM
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE void LL_RTC_ALMB_ConfigTime(uint32_t Format12_24, uint32_t Hours, uint32_t Minutes,
                                            uint32_t Seconds)
{
  uint32_t temp;

