MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
  temp = Format12_24 | (((Hours & 0xF0U) << (RTC_ALRMBR_HT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_ALRMBR_HU_Pos))    | \
         (((Minutes & 0xF0U) << (RTC_ALRMBR_MNT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMBR_MNU_Pos)) | \
         (((Seconds & 0xF0U) << (RTC_ALRMBR_ST_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMBR_SU_Pos));

  STM32_MODIFY_REG(RTC->ALRMBR, RTC_ALRMBR_PM | RTC_ALRMBR_HT | RTC_ALRMBR_HU | RTC_ALRMBR_MNT | RTC_ALRMBR_MNU | \
                   RTC_ALRMBR_ST | RTC_ALRMBR_SU, temp);
}

/**
  * @brief  Get alarm B time (hour, minute and second) in BCD format.
  * @rmtoll
  *  RTC_ALRMBR       HT            LL_RTC_ALMB_GetTime \n
  *  RTC_ALRMBR       HU            LL_RTC_ALMB_GetTime \n
  *  RTC_ALRMBR       MNT           LL_RTC_ALMB_GetTime \n
  *  RTC_ALRMBR       MNU           LL_RTC_ALMB_GetTime \n
  *  RTC_ALRMBR       ST            LL_RTC_ALMB_GetTime \n
  *  RTC_ALRMBR       SU            LL_RTC_ALMB_GetTime
  * @retval Combination of hours, minutes and seconds
  * @note   Helper macros LL_RTC_GET_HOUR, LL_RTC_GET_MINUTE and LL_RTC_GET_SECOND
  *         are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetTime(void)
{
  return (uint32_t)((LL_RTC_ALMB_GetHour() << RTC_OFFSET_HOUR) | (LL_RTC_ALMB_GetMinute() << \
                                                                  RTC_OFFSET_MINUTE) | LL_RTC_ALMB_GetSecond());
}

/**
  * @brief  Set alarm B mask for the most significant bits starting at this bit.
  * @rmtoll
  *  RTC_ALRMBSSR     MASKSS        LL_RTC_ALMB_SetSubSecondMask
  * @param  Mask If binary mode is not enabled, value between Min_Data=0x0 and Max_Data=0xF
  *              else value between Min_Data=0x0 and Max_Data=0x3F
  * @note   This register can be written only when ALRBE is reset in RTC_CR register
  *         or in initialization mode.
  */
__STATIC_INLINE void LL_RTC_ALMB_SetSubSecondMask(uint32_t Mask)
{
  STM32_MODIFY_REG(RTC->ALRMBSSR, RTC_ALRMBSSR_MASKSS, Mask << RTC_ALRMBSSR_MASKSS_Pos);
}

/**
  * @brief  Get alarm B mask for the most significant bits starting at this bit.
  * @rmtoll
  *  RTC_ALRMBSSR     MASKSS        LL_RTC_ALMB_GetSubSecondMask
  * @retval If binary mode is not enabled, value between Min_Data=0x0 and Max_Data=0xF
  *         else value between Min_Data=0x0 and Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetSubSecondMask(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMBSSR, RTC_ALRMBSSR_MASKSS) >> RTC_ALRMBSSR_MASKSS_Pos);
}

/**
  * @brief  Set alarm B binary mode auto-clear.
  * @rmtoll
  *  RTC_ALRMBSSR     SSCLR        LL_RTC_ALMB_SetBinAutoClr
  * @param  BinaryAutoClr This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALMB_SUBSECONDBIN_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALMB_SUBSECONDBIN_AUTOCLR_YES
  * @note   This register can be written only when ALRBE is reset in RTC_CR register
  *         or in initialization mode.
  * @note   SSCLR must be kept at 0 when BCD or mixed mode is used (BIN = 00, 10 or 11).
  */
__STATIC_INLINE void LL_RTC_ALMB_SetBinAutoClr(uint32_t BinaryAutoClr)
{
  STM32_MODIFY_REG(RTC->ALRMBSSR, RTC_ALRMBSSR_SSCLR, BinaryAutoClr);
}

/**
  * @brief  Get alarm B binary mode auto-clear.
  * @rmtoll
  *  RTC_ALRMBSSR     SSCLR        LL_RTC_ALMB_GetBinAutoClr
  * @retval It can be one of the following values:
  *         @arg @ref LL_RTC_ALMB_SUBSECONDBIN_AUTOCLR_NO
  *         @arg @ref LL_RTC_ALMB_SUBSECONDBIN_AUTOCLR_YES
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetBinAutoClr(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMBSSR, RTC_ALRMBSSR_SSCLR));
}

/**
  * @brief  Set alarm B subseconds value.
  * @rmtoll
  *  RTC_ALRMBSSR     SS            LL_RTC_ALMB_SetSubSecond
  * @param  Subsecond If binary mode is not enabled, value between Min_Data=0x0 and Max_Data=0x7FFF
  *                   else value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE void LL_RTC_ALMB_SetSubSecond(uint32_t Subsecond)
{
  STM32_MODIFY_REG(RTC->ALRMBSSR, RTC_ALRMBSSR_SS, Subsecond);
}

/**
  * @brief  Get alarm B subseconds value.
  * @rmtoll
  *  RTC_ALRMBSSR     SS            LL_RTC_ALMB_GetSubSecond
  * @retval If binary mode is not enabled, value between Min_Data=0x0 and Max_Data=0x7FFF
  *         else value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_RTC_ALMB_GetSubSecond(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->ALRMBSSR, RTC_ALRMBSSR_SS));
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_Timestamp Timestamp
  * @{
  */

/**
  * @brief  Enable timestamp.
  * @rmtoll
  *  RTC_CR           TSE           LL_RTC_TS_Enable
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_TS_Enable(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_TSE);
}

/**
  * @brief  Disable timestamp.
  * @rmtoll
  *  RTC_CR           TSE           LL_RTC_TS_Disable
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_TS_Disable(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_TSE);
}

/**
  * @brief  Check whether timestamp is enabled.
  * @rmtoll
  *  RTC_CR           TSE          LL_RTC_TS_IsEnabled
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_TS_IsEnabled(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_TSE) == (RTC_CR_TSE)) ? 1UL : 0UL);
}

/**
  * @brief  Set timestamp event active edge.
  * @rmtoll
  *  RTC_CR           TSEDGE        LL_RTC_TS_SetActiveEdge
  * @param  Edge This parameter can be one of the following values:
  *         @arg @ref LL_RTC_TIMESTAMP_EDGE_RISING
  *         @arg @ref LL_RTC_TIMESTAMP_EDGE_FALLING
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  * @note   TSE must be reset when TSEDGE is changed to avoid unwanted TSF setting
  */
__STATIC_INLINE void LL_RTC_TS_SetActiveEdge(uint32_t Edge)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_TSEDGE, Edge);
}

/**
  * @brief  Get timestamp event active edge.
  * @rmtoll
  *  RTC_CR           TSEDGE        LL_RTC_TS_GetActiveEdge
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_TIMESTAMP_EDGE_RISING
  *         @arg @ref LL_RTC_TIMESTAMP_EDGE_FALLING
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetActiveEdge(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, RTC_CR_TSEDGE));
}

/**
  * @brief  Get timestamp AM/PM notation (AM or 24-hour format).
  * @rmtoll
  *  RTC_TSTR         PM            LL_RTC_TS_GetTimeFormat
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_TS_TIME_FORMAT_AM_24H
  *         @arg @ref LL_RTC_TS_TIME_FORMAT_PM
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetTimeFormat(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSTR, RTC_TSTR_PM));
}

/**
  * @brief  Get timestamp hours in BCD format.
  * @rmtoll
  *  RTC_TSTR         HT            LL_RTC_TS_GetHour \n
  *  RTC_TSTR         HU            LL_RTC_TS_GetHour
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert hours from BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetHour(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSTR, RTC_TSTR_HT | RTC_TSTR_HU) >> RTC_TSTR_HU_Pos);
}

/**
  * @brief  Get timestamp minutes in BCD format.
  * @rmtoll
  *  RTC_TSTR         MNT           LL_RTC_TS_GetMinute \n
  *  RTC_TSTR         MNU           LL_RTC_TS_GetMinute
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert minutes from BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetMinute(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSTR, RTC_TSTR_MNT | RTC_TSTR_MNU) >> RTC_TSTR_MNU_Pos);
}

/**
  * @brief  Get timestamp seconds in BCD format.
  * @rmtoll
  *  RTC_TSTR         ST            LL_RTC_TS_GetSecond \n
  *  RTC_TSTR         SU            LL_RTC_TS_GetSecond
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert seconds from BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetSecond(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSTR, RTC_TSTR_ST | RTC_TSTR_SU));
}

/**
  * @brief  Get timestamp time (hour, minute and second) in BCD format.
  * @rmtoll
  *  RTC_TSTR         HT            LL_RTC_TS_GetTime \n
  *  RTC_TSTR         HU            LL_RTC_TS_GetTime \n
  *  RTC_TSTR         MNT           LL_RTC_TS_GetTime \n
  *  RTC_TSTR         MNU           LL_RTC_TS_GetTime \n
  *  RTC_TSTR         ST            LL_RTC_TS_GetTime \n
  *  RTC_TSTR         SU            LL_RTC_TS_GetTime
  * @retval Combination of hours, minutes and seconds
  * @note   Helper macros LL_RTC_GET_HOUR, LL_RTC_GET_MINUTE and LL_RTC_GET_SECOND
  *         are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetTime(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSTR,
                                   RTC_TSTR_HT | RTC_TSTR_HU | RTC_TSTR_MNT
                                   | RTC_TSTR_MNU | RTC_TSTR_ST | RTC_TSTR_SU));
}

/**
  * @brief  Get timestamp time (hour, minute and second) in BCD format and time format.
  * @rmtoll
  *  RTC_TSTR        PM            LL_RTC_TS_GetTimeAndFormat \n
  *  RTC_TSTR        HT            LL_RTC_TS_GetTimeAndFormat \n
  *  RTC_TSTR        HU            LL_RTC_TS_GetTimeAndFormat \n
  *  RTC_TSTR        MNT           LL_RTC_TS_GetTimeAndFormat \n
  *  RTC_TSTR        MNU           LL_RTC_TS_GetTimeAndFormat \n
  *  RTC_TSTR        ST            LL_RTC_TS_GetTimeAndFormat \n
  *  RTC_TSTR        SU            LL_RTC_TS_GetTimeAndFormat
  * @retval Combination of format, hours, minutes and seconds (Format: 0x0FHHMMSS)
  * @note   Helper macros LL_RTC_GET_FORMAT, LL_RTC_GET_HOUR, LL_RTC_GET_MINUTE,
  *         and LL_RTC_GET_SECOND are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetTimeAndFormat(void)
{
  uint32_t temp;

