MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
  temp = STM32_READ_BIT(RTC->TSTR, (RTC_TSTR_PM | RTC_TSTR_HT | RTC_TSTR_HU | RTC_TSTR_MNT | RTC_TSTR_MNU | \
                                    RTC_TSTR_ST | RTC_TSTR_SU));
  return (uint32_t)((((temp & RTC_TSTR_PM) >> RTC_TSTR_PM_Pos) << RTC_OFFSET_FORMAT) | \
                    (((((temp & RTC_TSTR_HT) >> RTC_TSTR_HT_Pos) << 4U) | \
                      ((temp & RTC_TSTR_HU) >> RTC_TSTR_HU_Pos)) << RTC_OFFSET_HOUR) | \
                    (((((temp & RTC_TSTR_MNT) >> RTC_TSTR_MNT_Pos) << 4U) | \
                      ((temp & RTC_TSTR_MNU) >> RTC_TSTR_MNU_Pos)) << RTC_OFFSET_MINUTE) | \
                    ((((temp & RTC_TSTR_ST) >> RTC_TSTR_ST_Pos) << 4U) | ((temp & RTC_TSTR_SU) >> RTC_TSTR_SU_Pos)));
}

/**
  * @brief  Get timestamp weekday.
  * @rmtoll
  *  RTC_TSDR         WDU           LL_RTC_TS_GetWeekDay
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_WEEKDAY_MONDAY
  *         @arg @ref LL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref LL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref LL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref LL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref LL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref LL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetWeekDay(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSDR, RTC_TSDR_WDU) >> RTC_TSDR_WDU_Pos);
}

/**
  * @brief  Get timestamp month in BCD format.
  * @rmtoll
  *  RTC_TSDR         MT            LL_RTC_TS_GetMonth \n
  *  RTC_TSDR         MU            LL_RTC_TS_GetMonth
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_MONTH_JANUARY
  *         @arg @ref LL_RTC_MONTH_FEBRUARY
  *         @arg @ref LL_RTC_MONTH_MARCH
  *         @arg @ref LL_RTC_MONTH_APRIL
  *         @arg @ref LL_RTC_MONTH_MAY
  *         @arg @ref LL_RTC_MONTH_JUNE
  *         @arg @ref LL_RTC_MONTH_JULY
  *         @arg @ref LL_RTC_MONTH_AUGUST
  *         @arg @ref LL_RTC_MONTH_SEPTEMBER
  *         @arg @ref LL_RTC_MONTH_OCTOBER
  *         @arg @ref LL_RTC_MONTH_NOVEMBER
  *         @arg @ref LL_RTC_MONTH_DECEMBER
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert month from BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetMonth(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSDR, RTC_TSDR_MT | RTC_TSDR_MU) >> RTC_TSDR_MU_Pos);
}

/**
  * @brief  Get timestamp day in BCD format.
  * @rmtoll
  *  RTC_TSDR         DT            LL_RTC_TS_GetDay \n
  *  RTC_TSDR         DU            LL_RTC_TS_GetDay
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  * @note   Helper macro LL_RTC_CONVERT_BCD2BIN is available to convert day from BCD to binary format
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetDay(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSDR, RTC_TSDR_DT | RTC_TSDR_DU));
}

/**
  * @brief  Get timestamp date (weekday, day and month) in BCD format.
  * @rmtoll
  *  RTC_TSDR         WDU           LL_RTC_TS_GetDate \n
  *  RTC_TSDR         MT            LL_RTC_TS_GetDate \n
  *  RTC_TSDR         MU            LL_RTC_TS_GetDate \n
  *  RTC_TSDR         DT            LL_RTC_TS_GetDate \n
  *  RTC_TSDR         DU            LL_RTC_TS_GetDate
  * @retval Combination of weekday, day and month
  * @note   Helper macros LL_RTC_GET_WEEKDAY, LL_RTC_GET_MONTH, and LL_RTC_GET_DAY
  *         are available to get independently each parameter
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetDate(void)
{
  uint32_t temp;

  temp = STM32_READ_BIT(RTC->TSDR, (RTC_TSDR_WDU | RTC_TSDR_MT | RTC_TSDR_MU | RTC_TSDR_DT | RTC_TSDR_DU));
  return (uint32_t)((((temp & RTC_TSDR_WDU) >> RTC_TSDR_WDU_Pos) << RTC_OFFSET_WEEKDAY) | \
                    (((((temp & RTC_TSDR_DT) >> RTC_TSDR_DT_Pos) << 4U) | ((temp & RTC_TSDR_DU) >> RTC_TSDR_DU_Pos)) \
                     << RTC_OFFSET_DAY)   | (((((temp & RTC_TSDR_MT) >> RTC_TSDR_MT_Pos) << 4U) | \
                                              ((temp & RTC_TSDR_MU) >> RTC_TSDR_MU_Pos)) << RTC_OFFSET_MONTH));
}

/**
  * @brief  Get timestamp subsecond value.
  * @rmtoll
  *  RTC_TSSSR        SS            LL_RTC_TS_GetSubSecond
  * @retval If binary mode is not enabled, value between Min_Data=0x0 and Max_Data=0x7FFF
  *         else value between Min_Data=0x0 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_RTC_TS_GetSubSecond(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->TSSSR, RTC_TSSSR_SS));
}
/**
  * @brief  Enable timestamp on tamper detection event.
  * @rmtoll
  *  RTC_CR       TAMPTS        LL_RTC_TS_EnableOnTamper
  */
__STATIC_INLINE void LL_RTC_TS_EnableOnTamper(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_TAMPTS);
}

/**
  * @brief  Disable timestamp on tamper detection event.
  * @rmtoll
  *  RTC_CR       TAMPTS        LL_RTC_TS_DisableOnTamper
  */
__STATIC_INLINE void LL_RTC_TS_DisableOnTamper(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_TAMPTS);
}

/**
  * @brief  Check whether timestamp on tamper detection is enabled.
  * @rmtoll
  *  RTC_CR           TSE          LL_RTC_TS_IsEnabledOnTamper
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_TS_IsEnabledOnTamper(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_TAMPTS) == (RTC_CR_TAMPTS)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_Wakeup Wake-up
  * @{
  */

/**
  * @brief  Enable wake-up timer.
  * @rmtoll
  *  RTC_CR           WUTE          LL_RTC_WAKEUP_Enable
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_WAKEUP_Enable(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_WUTE);
}

/**
  * @brief  Disable wake-up timer.
  * @rmtoll
  *  RTC_CR           WUTE          LL_RTC_WAKEUP_Disable
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_WAKEUP_Disable(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_WUTE);
}

/**
  * @brief  Check whether wake-up timer is enabled.
  * @rmtoll
  *  RTC_CR           WUTE          LL_RTC_WAKEUP_IsEnabled
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_WAKEUP_IsEnabled(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_WUTE) == (RTC_CR_WUTE)) ? 1UL : 0UL);
}

/**
  * @brief  Start wake-up timer in interruption or polling mode.
  * @rmtoll
  *  RTC_CR          WUTE          LL_RTC_WAKEUP_Start \n
  *  RTC_CR          WUTIE         LL_RTC_WAKEUP_Start
  * @param  Interruption This parameter can be one of the following values:
  *         @arg @ref LL_RTC_WAKEUP_TIMER_IT_DISABLE
  *         @arg @ref LL_RTC_WAKEUP_TIMER_IT_ENABLE
  */
__STATIC_INLINE void LL_RTC_WAKEUP_Start(uint32_t Interruption)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_WUTE | RTC_CR_WUTIE, RTC_CR_WUTE | Interruption);
}

/**
  * @brief  Stop wake-up timer.
  * @rmtoll
  *  RTC_CR          WUTE          LL_RTC_WAKEUP_Stop \n
  *  RTC_CR          WUTIE         LL_RTC_WAKEUP_Stop
  */
__STATIC_INLINE void LL_RTC_WAKEUP_Stop(void)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_WUTE | RTC_CR_WUTIE, 0U);
}

/**
  * @brief  Select wake-up clock.
  * @rmtoll
  *  RTC_CR           WUCKSEL       LL_RTC_WAKEUP_SetClock
  * @param  WakeupClock This parameter can be one of the following values:
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_16
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_8
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_4
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_2
  *         @arg @ref LL_RTC_WAKEUPCLOCK_CKSPRE
  *         @arg @ref LL_RTC_WAKEUPCLOCK_CKSPRE_WUT
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  * @note   Bit can be written only when RTC_CR WUTE bit = 0 and RTC_ICSR WUTWF bit = 1
  */
__STATIC_INLINE void LL_RTC_WAKEUP_SetClock(uint32_t WakeupClock)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_WUCKSEL, WakeupClock);
}

/**
  * @brief  Get wake-up clock.
  * @rmtoll
  *  RTC_CR           WUCKSEL       LL_RTC_WAKEUP_GetClock
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_16
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_8
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_4
  *         @arg @ref LL_RTC_WAKEUPCLOCK_DIV_2
  *         @arg @ref LL_RTC_WAKEUPCLOCK_CKSPRE
  *         @arg @ref LL_RTC_WAKEUPCLOCK_CKSPRE_WUT
  */
__STATIC_INLINE uint32_t LL_RTC_WAKEUP_GetClock(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, RTC_CR_WUCKSEL));
}

/**
  * @brief  Set wake-up auto-reload value.
  * @rmtoll
  *  RTC_WUTR         WUT           LL_RTC_WAKEUP_SetAutoReload
  * @param  Value Value between Min_Data=0x00 and Max_Data=0xFFFF
  * @note   Bit can be written only when WUTWF is set to 1 in RTC_ICSR
  */
__STATIC_INLINE void LL_RTC_WAKEUP_SetAutoReload(uint32_t Value)
{
  STM32_MODIFY_REG(RTC->WUTR, RTC_WUTR_WUT, Value);
}

/**
  * @brief  Get wake-up auto-reload value.
  * @rmtoll
  *  RTC_WUTR         WUT           LL_RTC_WAKEUP_GetAutoReload
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_RTC_WAKEUP_GetAutoReload(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->WUTR, RTC_WUTR_WUT));
}

/**
  * @brief  Set wake-up auto-reload clear value.
  * @rmtoll
  *  RTC_WUTR         WUTOCLR           LL_RTC_WAKEUP_SetAutoClear
  * @param  Value Value between Min_Data=0x00 and Max_Data=0xFFFF
  * @note   Bit can be written only when WUTWF is set to 1 in RTC_ICSR
  */
__STATIC_INLINE void LL_RTC_WAKEUP_SetAutoClear(uint32_t Value)
{
  STM32_MODIFY_REG(RTC->WUTR, RTC_WUTR_WUTOCLR, Value << RTC_WUTR_WUTOCLR_Pos);
}

/**
  * @brief  Get wake-up auto-reload clear value.
  * @rmtoll
  *  RTC_WUTR         WUTOCLR           LL_RTC_WAKEUP_GetAutoClear
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_RTC_WAKEUP_GetAutoClear(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->WUTR, RTC_WUTR_WUTOCLR) >> RTC_WUTR_WUTOCLR_Pos);
}

/**
  * @brief  Set wake-up auto-reload and auto-reload clear values.
  * @rmtoll
  *  RTC_WUTR         WUTOCLR           LL_RTC_WAKEUP_Config \n
  *  RTC_WUTR         WUT               LL_RTC_WAKEUP_Config
  * @param  Reload Value between Min_Data=0x00 and Max_Data=0xFFFF
  * @param  Clear Value between Min_Data=0x00 and Max_Data=0xFFFF
  * @note   Bit can be written only when WUTWF is set to 1 in RTC_ICSR
  */
__STATIC_INLINE void LL_RTC_WAKEUP_Config(uint32_t Reload, uint32_t Clear)
{
  STM32_WRITE_REG(RTC->WUTR, ((Clear << RTC_WUTR_WUTOCLR_Pos) & RTC_WUTR_WUTOCLR_Msk) | (Reload & RTC_WUTR_WUT_Msk));
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_Calibration Calibration
  * @{
  */

/**
  * @brief  Set calibration output frequency (1 Hz or 512 Hz).
  * @rmtoll
  *  RTC_CR           COE           LL_RTC_CAL_SetOutputFreq \n
  *  RTC_CR           COSEL         LL_RTC_CAL_SetOutputFreq
  * @param  Frequency This parameter can be one of the following values:
  *         @arg @ref LL_RTC_CALIB_OUTPUT_NONE
  *         @arg @ref LL_RTC_CALIB_OUTPUT_1HZ
  *         @arg @ref LL_RTC_CALIB_OUTPUT_512HZ
  * @note   Bits are write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_CAL_SetOutputFreq(uint32_t Frequency)
{
  STM32_MODIFY_REG(RTC->CR, RTC_CR_COE | RTC_CR_COSEL, Frequency);
}

/**
  * @brief  Get calibration output frequency (1 Hz or 512 Hz).
  * @rmtoll
  *  RTC_CR           COE           LL_RTC_CAL_GetOutputFreq \n
  *  RTC_CR           COSEL         LL_RTC_CAL_GetOutputFreq
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_CALIB_OUTPUT_NONE
  *         @arg @ref LL_RTC_CALIB_OUTPUT_1HZ
  *         @arg @ref LL_RTC_CALIB_OUTPUT_512HZ
  */
__STATIC_INLINE uint32_t LL_RTC_CAL_GetOutputFreq(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CR, RTC_CR_COE | RTC_CR_COSEL));
}

/**
  * @brief  Insert or do not insert one RTCCLK pulse every 2exp11 pulses (frequency increased by 488.5 ppm).
  * @rmtoll
  *  RTC_CALR         CALP          LL_RTC_CAL_SetPulse
  * @param  Pulse This parameter can be one of the following values:
  *         @arg @ref LL_RTC_CALIB_INSERTPULSE_NONE
  *         @arg @ref LL_RTC_CALIB_INSERTPULSE_SET
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  * @note   Bit can be written only when RECALPF is set to 0 in RTC_ICSR
  */
__STATIC_INLINE void LL_RTC_CAL_SetPulse(uint32_t Pulse)
{
  STM32_MODIFY_REG(RTC->CALR, RTC_CALR_CALP, Pulse);
}

/**
  * @brief  Check whether one RTCCLK has been inserted every 2exp11 pulses (frequency increased by 488.5 ppm).
  * @rmtoll
  *  RTC_CALR         CALP          LL_RTC_CAL_IsPulseInserted
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_CAL_IsPulseInserted(void)
{
  return ((STM32_READ_BIT(RTC->CALR, RTC_CALR_CALP) == (RTC_CALR_CALP)) ? 1UL : 0UL);
}

/**
  * @brief  Set the calibration cycle period.
  * @rmtoll
  *  RTC_CALR         CALW8         LL_RTC_CAL_SetPeriod \n
  *  RTC_CALR         CALW16        LL_RTC_CAL_SetPeriod
  * @param  Period This parameter can be one of the following values:
  *         @arg @ref LL_RTC_CALIB_PERIOD_32SEC
  *         @arg @ref LL_RTC_CALIB_PERIOD_16SEC
  *         @arg @ref LL_RTC_CALIB_PERIOD_8SEC
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  * @note   Bit can be written only when RECALPF is set to 0 in RTC_ICSR
  */
__STATIC_INLINE void LL_RTC_CAL_SetPeriod(uint32_t Period)
{
  STM32_MODIFY_REG(RTC->CALR, RTC_CALR_CALW8 | RTC_CALR_CALW16, Period);
}

/**
  * @brief  Get the calibration cycle period.
  * @rmtoll
  *  RTC_CALR         CALW8         LL_RTC_CAL_GetPeriod \n
  *  RTC_CALR         CALW16        LL_RTC_CAL_GetPeriod
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RTC_CALIB_PERIOD_32SEC
  *         @arg @ref LL_RTC_CALIB_PERIOD_16SEC
  *         @arg @ref LL_RTC_CALIB_PERIOD_8SEC
  */
__STATIC_INLINE uint32_t LL_RTC_CAL_GetPeriod(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CALR, RTC_CALR_CALW8 | RTC_CALR_CALW16));
}

/**
  * @brief  Set calibration minus.
  * @rmtoll
  *  RTC_CALR         CALM          LL_RTC_CAL_SetMinus
  * @param  CalibMinus Value between Min_Data=0x00 and Max_Data=0x1FF
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  * @note   Bit can be written only when RECALPF is set to 0 in RTC_ICSR
  */
__STATIC_INLINE void LL_RTC_CAL_SetMinus(uint32_t CalibMinus)
{
  STM32_MODIFY_REG(RTC->CALR, RTC_CALR_CALM, CalibMinus);
}

/**
  * @brief  Get calibration minus.
  * @rmtoll
  *  RTC_CALR         CALM          LL_RTC_CAL_GetMinus
  * @retval Value between Min_Data=0x00 and Max_Data=0x1FF
  */
__STATIC_INLINE uint32_t LL_RTC_CAL_GetMinus(void)
{
  return (uint32_t)(STM32_READ_BIT(RTC->CALR, RTC_CALR_CALM));
}

/**
  * @brief Set smooth calibration.
  * @rmtoll
  *  RTC_CALR         CALP          LL_RTC_CAL_SetSmoothCalibration \n
  *  RTC_CALR         CALW8         LL_RTC_CAL_SetSmoothCalibration \n
  *  RTC_CALR         CALW16        LL_RTC_CAL_SetSmoothCalibration \n
  *  RTC_CALR         CALM          LL_RTC_CAL_SetSmoothCalibration
  * @param SmoothCalibPeriod This parameter can be one of the following values:
  *        @arg @ref LL_RTC_CALIB_PERIOD_32SEC
  *        @arg @ref LL_RTC_CALIB_PERIOD_16SEC
  *        @arg @ref LL_RTC_CALIB_PERIOD_8SEC
  * @param SmoothCalibPlusPulses This parameter can be one of the following values:
  *        @arg @ref LL_RTC_CALIB_INSERTPULSE_NONE
  *        @arg @ref LL_RTC_CALIB_INSERTPULSE_SET
  * @param SmoothCalibMinusPulsesValue Value between Min_Data=0x00 and Max_Data=0x1FF
  */
__STATIC_INLINE void LL_RTC_CAL_SetSmoothCalibration(uint32_t SmoothCalibPeriod,
                                                     uint32_t SmoothCalibPlusPulses,
                                                     uint32_t SmoothCalibMinusPulsesValue)
{
  STM32_MODIFY_REG(RTC->CALR, (RTC_CALR_CALP | RTC_CALR_CALW8 | RTC_CALR_CALW16 | RTC_CALR_CALM),
                   (uint32_t)(SmoothCalibPeriod | SmoothCalibPlusPulses | SmoothCalibMinusPulsesValue));
}

/**
  * @brief  Check if the smooth calibration is enabled.
  * @rmtoll
  *  RTC_CALR         CALP          LL_RTC_CAL_IsEnabledSmoothCalibration \n
  *  RTC_CALR         CALM          LL_RTC_CAL_IsEnabledSmoothCalibration
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_CAL_IsEnabledSmoothCalibration(void)
{
  return ((STM32_READ_BIT(RTC->CALR, RTC_CALR_CALP | RTC_CALR_CALM) == 0U) ? 0UL : 1UL);
}

/**
  * @brief  Enable calibration low power.
  * @rmtoll
  *  RTC_CALR         LPCAL          LL_RTC_CAL_LowPower_Enable
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  * @note   Bit can be written only when RECALPF is set to 0
  */
__STATIC_INLINE void LL_RTC_CAL_LowPower_Enable(void)
{
  STM32_SET_BIT(RTC->CALR, RTC_CALR_LPCAL);
}

/**
  * @brief  Disable calibration low power.
  * @rmtoll
  *  RTC_CALR         LPCAL          LL_RTC_CAL_LowPower_Disable
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  * @note   Bit can be written only when RECALPF is set to 0
  */
__STATIC_INLINE void LL_RTC_CAL_LowPower_Disable(void)
{
  STM32_CLEAR_BIT(RTC->CALR, RTC_CALR_LPCAL);
}

/**
  * @brief  Check whether calibration low power is enabled.
  * @rmtoll
  *  RTC_CALR         LPCAL          LL_RTC_CAL_LowPower_IsEnabled
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_CAL_LowPower_IsEnabled(void)
{
  return ((STM32_READ_BIT(RTC->CALR, RTC_CALR_LPCAL) == (RTC_CALR_LPCAL)) ? 1UL : 0UL);
}

/**
  * @}
  */

