MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rtc.h
/** @defgroup RTC_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Get Recalibration pending flag.
  * @rmtoll
  *  RTC_ICSR          RECALPF       LL_RTC_IsActiveFlag_RECALP
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_RECALP(void)
{
  return ((STM32_READ_BIT(RTC->ICSR, RTC_ICSR_RECALPF) == (RTC_ICSR_RECALPF)) ? 1UL : 0UL);
}

/**
  * @brief  Get timestamp flag.
  * @rmtoll
  *  RTC_SR          TSF           LL_RTC_IsActiveFlag_TS
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_TS(void)
{
  return ((STM32_READ_BIT(RTC->SR, RTC_SR_TSF) == (RTC_SR_TSF)) ? 1UL : 0UL);
}

/**
  * @brief  Get timestamp overflow flag.
  * @rmtoll
  *  RTC_SR          TSOVF         LL_RTC_IsActiveFlag_TSOV
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_TSOV(void)
{
  return ((STM32_READ_BIT(RTC->SR, RTC_SR_TSOVF) == (RTC_SR_TSOVF)) ? 1UL : 0UL);
}

/**
  * @brief  Get wake-up timer flag.
  * @rmtoll
  *  RTC_SR          WUTF          LL_RTC_IsActiveFlag_WUT
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_WUT(void)
{
  return ((STM32_READ_BIT(RTC->SR, RTC_SR_WUTF) == (RTC_SR_WUTF)) ? 1UL : 0UL);
}

/**
  * @brief  Get alarm A flag.
  * @rmtoll
  *  RTC_SR          ALRAF         LL_RTC_IsActiveFlag_ALRA
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_ALRA(void)
{
  return ((STM32_READ_BIT(RTC->SR, RTC_SR_ALRAF) == (RTC_SR_ALRAF)) ? 1UL : 0UL);
}

/**
  * @brief  Get alarm B flag.
  * @rmtoll
  *  RTC_SR          ALRBF         LL_RTC_IsActiveFlag_ALRB
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_ALRB(void)
{
  return ((STM32_READ_BIT(RTC->SR, RTC_SR_ALRBF) == (RTC_SR_ALRBF)) ? 1UL : 0UL);
}

/**
  * @brief  Get selected alarm flag.
  * @rmtoll
  *  RTC_SR          ALRBF         LL_RTC_IsActiveFlag_ALR \n
  *  RTC_SR          ALRAF         LL_RTC_IsActiveFlag_ALR
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A
  *         @arg @ref LL_RTC_ALARM_B
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_ALR(const uint32_t Alarm)
{
  return ((STM32_READ_BIT(RTC->SR, (RTC_SR_ALRAF << Alarm)) == (RTC_SR_ALRAF << Alarm)) ? 1UL : 0UL);
}

/**
  * @brief  Get SSR Underflow flag.
  * @rmtoll
  *  RTC_SR          SSRUF         LL_RTC_IsActiveFlag_SSRU
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_SSRU(void)
{
  return ((STM32_READ_BIT(RTC->SR, RTC_SR_SSRUF) == (RTC_SR_SSRUF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Timestamp flag.
  * @rmtoll
  *  RTC_SR         CTSF           LL_RTC_ClearFlag_TS
  */
__STATIC_INLINE void LL_RTC_ClearFlag_TS(void)
{
  STM32_WRITE_REG(RTC->SCR, RTC_SCR_CTSF);
}

/**
  * @brief  Clear Timestamp overflow flag.
  * @rmtoll
  *  RTC_SCR          CTSOVF         LL_RTC_ClearFlag_TSOV
  */
__STATIC_INLINE void LL_RTC_ClearFlag_TSOV(void)
{
  STM32_WRITE_REG(RTC->SCR, RTC_SCR_CTSOVF);
}

/**
  * @brief  Clear wake-up timer flag.
  * @rmtoll
  *  RTC_SCR          CWUTF          LL_RTC_ClearFlag_WUT
  */
__STATIC_INLINE void LL_RTC_ClearFlag_WUT(void)
{
  STM32_WRITE_REG(RTC->SCR, RTC_SCR_CWUTF);
}

/**
  * @brief  Clear alarm A flag.
  * @rmtoll
  *  RTC_SCR          CALRAF         LL_RTC_ClearFlag_ALRA
  */
__STATIC_INLINE void LL_RTC_ClearFlag_ALRA(void)
{
  STM32_WRITE_REG(RTC->SCR, RTC_SCR_CALRAF);
}

/**
  * @brief  Clear alarm B flag.
  * @rmtoll
  *  RTC_SCR          CALRBF         LL_RTC_ClearFlag_ALRB
  */
__STATIC_INLINE void LL_RTC_ClearFlag_ALRB(void)
{
  STM32_WRITE_REG(RTC->SCR, RTC_SCR_CALRBF);
}

/**
  * @brief  Clear the selected alarm flag.
  * @rmtoll
  *         RTC_SCR          CALRBF         LL_RTC_ClearFlag_ALR \n
  *  RTC_SCR          CALRAF         LL_RTC_ClearFlag_ALR
  * @param  Alarm This parameter can be one of the following values:
  *         @arg @ref LL_RTC_ALARM_A Alarm A
  *         @arg @ref LL_RTC_ALARM_B Alarm B
  */
__STATIC_INLINE void LL_RTC_ClearFlag_ALR(uint32_t Alarm)
{
  STM32_WRITE_REG(RTC->SCR, RTC_SCR_CALRAF << Alarm);
}

/**
  * @brief  Clear SSR Underflow flag.
  * @rmtoll
  *  RTC_SCR          CSSRUF         LL_RTC_ClearFlag_SSRU
  */
__STATIC_INLINE void LL_RTC_ClearFlag_SSRU(void)
{
  STM32_WRITE_REG(RTC->SCR, RTC_SCR_CSSRUF);
}

/**
  * @brief  Get Initialization flag.
  * @rmtoll
  *  RTC_ICSR          INITF         LL_RTC_IsActiveFlag_INIT
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_INIT(void)
{
  return ((STM32_READ_BIT(RTC->ICSR, RTC_ICSR_INITF) == (RTC_ICSR_INITF)) ? 1UL : 0UL);
}

/**
  * @brief  Get Registers synchronization flag.
  * @rmtoll
  *  RTC_ICSR          RSF           LL_RTC_IsActiveFlag_RS
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_RS(void)
{
  return ((STM32_READ_BIT(RTC->ICSR, RTC_ICSR_RSF) == (RTC_ICSR_RSF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Registers synchronization flag.
  * @rmtoll
  *  RTC_ICSR          RSF           LL_RTC_ClearFlag_RS
  */
__STATIC_INLINE void LL_RTC_ClearFlag_RS(void)
{
  STM32_CLEAR_BIT(RTC->ICSR, RTC_ICSR_RSF);
}

/**
  * @brief  Get Initialization status flag.
  * @rmtoll
  *  RTC_ICSR          INITS         LL_RTC_IsActiveFlag_INITS
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_INITS(void)
{
  return ((STM32_READ_BIT(RTC->ICSR, RTC_ICSR_INITS) == (RTC_ICSR_INITS)) ? 1UL : 0UL);
}

/**
  * @brief  Get Shift operation pending flag.
  * @rmtoll
  *  RTC_ICSR          SHPF          LL_RTC_IsActiveFlag_SHP
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_SHP(void)
{
  return ((STM32_READ_BIT(RTC->ICSR, RTC_ICSR_SHPF) == (RTC_ICSR_SHPF)) ? 1UL : 0UL);
}

/**
  * @brief  Get wake-up timer write flag.
  * @rmtoll
  *  RTC_ICSR          WUTWF         LL_RTC_IsActiveFlag_WUTW
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_WUTW(void)
{
  return ((STM32_READ_BIT(RTC->ICSR, RTC_ICSR_WUTWF) == (RTC_ICSR_WUTWF)) ? 1UL : 0UL);
}

/**
  * @brief  Get alarm A masked flag.
  * @rmtoll
  *  RTC_MISR          ALRAMF        LL_RTC_IsActiveFlag_ALRAM
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_ALRAM(void)
{
  return ((STM32_READ_BIT(RTC->MISR, RTC_MISR_ALRAMF) == (RTC_MISR_ALRAMF)) ? 1UL : 0UL);
}

/**
  * @brief  Get SSR Underflow masked flag.
  * @rmtoll
  *  RTC_MISR          SSRUMF        LL_RTC_IsActiveFlag_SSRUM
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_SSRUM(void)
{
  return ((STM32_READ_BIT(RTC->MISR, RTC_MISR_SSRUMF) == (RTC_MISR_SSRUMF)) ? 1UL : 0UL);
}

/**
  * @brief  Get alarm B masked flag.
  * @rmtoll
  *  RTC_MISR          ALRBMF        LL_RTC_IsActiveFlag_ALRBM
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_ALRBM(void)
{
  return ((STM32_READ_BIT(RTC->MISR, RTC_MISR_ALRBMF) == (RTC_MISR_ALRBMF)) ? 1UL : 0UL);
}

/**
  * @brief  Get wake-up timer masked flag.
  * @rmtoll
  *  RTC_MISR          WUTMF        LL_RTC_IsActiveFlag_WUTM
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_WUTM(void)
{
  return ((STM32_READ_BIT(RTC->MISR, RTC_MISR_WUTMF) == (RTC_MISR_WUTMF)) ? 1UL : 0UL);
}

/**
  * @brief  Get timestamp masked flag.
  * @rmtoll
  *  RTC_MISR          TSMF        LL_RTC_IsActiveFlag_TSM
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_TSM(void)
{
  return ((STM32_READ_BIT(RTC->MISR, RTC_MISR_TSMF) == (RTC_MISR_TSMF)) ? 1UL : 0UL);
}

/**
  * @brief  Get timestamp overflow masked flag.
  * @rmtoll
  *  RTC_MISR          TSOVMF        LL_RTC_IsActiveFlag_TSOVM
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsActiveFlag_TSOVM(void)
{
  return ((STM32_READ_BIT(RTC->MISR, RTC_MISR_TSOVMF) == (RTC_MISR_TSOVMF)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_Privilege_Services Privilege Services
  * @{
  */

/**
  * @brief  Set privilege attribute configuration.
  * @rmtoll
  *  PRIVCFGR           ALRAPRIV            LL_RTC_SetPrivAttr \n
  *  PRIVCFGR           ALRBPRIV            LL_RTC_SetPrivAttr \n
  *  PRIVCFGR           WUTPRIV             LL_RTC_SetPrivAttr \n
  *  PRIVCFGR           TSPRIV              LL_RTC_SetPrivAttr \n
  *  PRIVCFGR           CALPRIV             LL_RTC_SetPrivAttr \n
  *  PRIVCFGR           INITPRIV            LL_RTC_SetPrivAttr \n
  *  PRIVCFGR           PRIV                LL_RTC_SetPrivAttr
  * @param item This parameter can be one or a combination of the following values:
  *        @arg @ref LL_RTC_PRIV_ITEM_ALRAPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_ALRBPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_WUTPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_TSPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_CALPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_INITPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_PRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_ALL
  * @param priv_attr This parameter can be one of the following values:
  *        @arg @ref LL_RTC_ATTR_PRIV
  *        @arg @ref LL_RTC_ATTR_NPRIV
  */
__STATIC_INLINE void LL_RTC_SetPrivAttr(uint32_t item, uint32_t priv_attr)
{
  STM32_MODIFY_REG(RTC->PRIVCFGR, item, (item & ((~priv_attr) + 1U)));
}

/**
  * @brief  Get privilege attribute configuration.
  * @rmtoll
  *  PRIVCFGR           ALRAPRIV            LL_RTC_GetPrivAttr \n
  *  PRIVCFGR           ALRBPRIV            LL_RTC_GetPrivAttr \n
  *  PRIVCFGR           WUTPRIV             LL_RTC_GetPrivAttr \n
  *  PRIVCFGR           TSPRIV              LL_RTC_GetPrivAttr \n
  *  PRIVCFGR           CALPRIV             LL_RTC_GetPrivAttr \n
  *  PRIVCFGR           INITPRIV            LL_RTC_GetPrivAttr \n
  *  PRIVCFGR           PRIV                LL_RTC_GetPrivAttr
  * @param  item This parameter can be one of the following values:
  *        @arg @ref LL_RTC_PRIV_ITEM_ALRAPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_ALRBPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_WUTPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_TSPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_CALPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_INITPRIV
  *        @arg @ref LL_RTC_PRIV_ITEM_PRIV
  * @retval Status of bit (1 or 0).
  *         - 1: Privileged attribute enabled for the item.
  *         - 0: Non-privileged attribute for the item.
  */
__STATIC_INLINE uint32_t LL_RTC_GetPrivAttr(uint32_t item)
{
  return ((STM32_READ_BIT(RTC->PRIVCFGR, item) == (item)) ? LL_RTC_ATTR_PRIV : LL_RTC_ATTR_NPRIV);
}
/**
  * @}
  */

/** @defgroup RTC_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable timestamp interrupt.
  * @rmtoll
  *  RTC_CR          TSIE         LL_RTC_EnableIT_TS
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_EnableIT_TS(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_TSIE);
}

/**
  * @brief  Disable timestamp interrupt.
  * @rmtoll
  *  RTC_CR          TSIE         LL_RTC_DisableIT_TS
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_DisableIT_TS(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_TSIE);
}

/**
  * @brief  Enable wake-up timer interrupt.
  * @rmtoll
  *  RTC_CR          WUTIE         LL_RTC_EnableIT_WUT
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_EnableIT_WUT(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_WUTIE);
}

/**
  * @brief  Disable wake-up timer interrupt.
  * @rmtoll
  *  RTC_CR          WUTIE         LL_RTC_DisableIT_WUT
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_DisableIT_WUT(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_WUTIE);
}

/**
  * @brief  Enable alarm B interrupt.
  * @rmtoll
  *  RTC_CR           ALRBIE        LL_RTC_EnableIT_ALRB
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_EnableIT_ALRB(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_ALRBIE);
}

/**
  * @brief  Disable alarm B interrupt.
  * @rmtoll
  *  RTC_CR           ALRBIE        LL_RTC_DisableIT_ALRB
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_DisableIT_ALRB(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_ALRBIE);
}

/**
  * @brief  Enable alarm A interrupt.
  * @rmtoll
  *  RTC_CR           ALRAIE        LL_RTC_EnableIT_ALRA
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_EnableIT_ALRA(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_ALRAIE);
}

/**
  * @brief  Disable alarm A interrupt.
  * @rmtoll
  *  RTC_CR           ALRAIE        LL_RTC_DisableIT_ALRA
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_DisableIT_ALRA(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_ALRAIE);
}

/**
  * @brief  Enable SSR underflow interrupt.
  * @rmtoll
  *  RTC_CR           SSRUIE        LL_RTC_EnableIT_SSRU
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_EnableIT_SSRU(void)
{
  STM32_SET_BIT(RTC->CR, RTC_CR_SSRUIE);
}

/**
  * @brief  Disable SSR underflow interrupt.
  * @rmtoll
  *  RTC_CR           SSRUIE        LL_RTC_DisableIT_SSRU
  * @note   Bit is write-protected. Call @ref LL_RTC_DisableWriteProtection before.
  */
__STATIC_INLINE void LL_RTC_DisableIT_SSRU(void)
{
  STM32_CLEAR_BIT(RTC->CR, RTC_CR_SSRUIE);
}

/**
  * @brief  Check whether timestamp interrupt is enabled.
  * @rmtoll
  *  RTC_CR           TSIE          LL_RTC_IsEnabledIT_TS
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledIT_TS(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_TSIE) == (RTC_CR_TSIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether wake-up timer interrupt is enabled.
  * @rmtoll
  *  RTC_CR           WUTIE         LL_RTC_IsEnabledIT_WUT
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledIT_WUT(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_WUTIE) == (RTC_CR_WUTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether alarm A interrupt is enabled.
  * @rmtoll
  *  RTC_CR           ALRAIE        LL_RTC_IsEnabledIT_ALRA
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledIT_ALRA(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_ALRAIE) == (RTC_CR_ALRAIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether alarm B interrupt is enabled.
  * @rmtoll
  *  RTC_CR           ALRBIE        LL_RTC_IsEnabledIT_ALRB
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledIT_ALRB(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_ALRBIE) == (RTC_CR_ALRBIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether SSR underflow interrupt is enabled.
  * @rmtoll
  *  RTC_CR           SSRUIE        LL_RTC_IsEnabledIT_SSRU
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RTC_IsEnabledIT_SSRU(void)
{
  return ((STM32_READ_BIT(RTC->CR, RTC_CR_SSRUIE) == (RTC_CR_SSRUIE)) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
 */

/**
  * @}
  */

#endif /* defined(RTC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5xx_LL_RTC_H */
